export const council_periods = [
  {
    meta: {
      period: -4,
      year: "۷۷-اسفند ۷۸",
      faTitle: "دوره منفی چهار (سال ۷۷-اسفند ۷۸)",
      description: "شورای صنفی دانشکده مهندسی کامپیوتر (اولین دوره)؛ آغاز تلاش‌های صنفی به‌صورت دانشکده‌ای."
    },
    units: [
      {
        name: "دانشکده مهندسی کامپیوتر",
        members: [
          { name: "حمید ضرابی‌زاده" },
          { name: "امین صابری" },
          { name: "حمیدرضا چیت‌ساز" },
          { name: "سیدبشیرسجاد" },
          { name: "بابک فرزاد" },
          { name: "مونا وجیه الهی" },
          { name: "احسان چینی‌فروشان" },
          { name: "مسلم کاظمی" },
        ]
      }
    ]
  },
  {
    meta: {
      period: -3,
      year: "۷۸-۷۹",
      faTitle: "دوره منفی سه (سال ۷۸-۷۹)",
      description: "دانشکده ریاضی؛ اولین انتخابات اسفند ۱۳۷۹ برگزار شد.  (اولین شورای صنفی دانشکده ریاضی.  انتخابات بعدی ریاضی در ۱۳۸۰ بوده است)"
    },
    units: [
      {
        name: "دانشکده ریاضی",
        notes: "انتخابات اسفند ۱۳۷۹ و اولین دوره صنفی دانشکده. انتخابات بعدی در ۱۳۸۰ بوده است."
      }
    ]
  },
  {
    meta: {
      period: -2,
      year: "۷۹-۸۰",
      faTitle: "دوره منفی دو (سال ۷۹-۸۰)",
      description: "دوره آغاز شورای صنفی مرکز و دیگر دانشکده‌ها."
    },
    units: [
      {
        name: "دانشکده فیزیک",
        members: [
          { name: "آقای ؟؟ تابعی" }
        ]
      },
      {
        name: "دانشکده مهندسی مواد (از ۷۹ تا ۸۱)",
        members: [
          { name: "مهدی عطارچی" }
        ]
      },
      {
        name: "دانشکده مهندسی شیمی",
        members: [
          { name: "مریم ستاری" }
        ]
      },
      {
        name: "دانشکده مهندسی مکانیک",
        members: [
          { name: "؟؟ حکاک" },
          { name: "اصلانی" }
        ]
      },
      {
        name: "خوابگاه زنجان (احمدی روشن) (؟؟-احتمالا ۸۰)",
        members: [
          { name: "ابوالفضل محمودی", role: "دبیر و نماینده در دانشگاه" }
        ]
      }
    ]
  },
  {
    meta: {
      period: -1,
      year: "۸۰-۸۱",
      faTitle: "دوره منفی یک (سال ۸۰-۸۱)",
      description: "دومین موج شوراهای صنفی؛ بعضی دانشکده‌ها انتخابات برگزار کردند."
    },
    units: [
      {
        name: "دانشکده ریاضی (اردیبهشت ۱۳۸۰)",
        members: [
          { name: "محمدحسین مشتاق" },
          { name: "سارا روحانی" },
          { name: "سلمان ابوالفتح بیگی", notes: "ورودی ۷۹" },
          { name: "بابک ظفری", notes: "ورودی ۷۹" },
          { name: "اعظم حیدری" },
          { name: "آویشا صادقی نژاد", notes: "علی‌البدل که با استعفای اعظم حیدری اصلی شد" }
        ]
      },
      {
        name: "دانشکده مهندسی کامپیوتر (۲۵-۲۶-۲۹ اردیبهشت ۱۳۸۰)",
        members: [
          { name: "حجت شیخ‌عطار" },
          { name: "احسان فروغی" },
          { name: "میثم صیادیان" },
          { name: "شادی آشنایی" },
          { name: "محمد بدری" },
          { name: "روزبه متقی" },
          { name: "سید فواد طباطبایی" },
          { name: "آناهیتا بصیرت", notes: "علی‌البدل" },
          { name: "البرز گرامی‌فرد", notes: "علی‌البدل" }
        ]
      },
      {
        name: "دانشکده مهندسی عمران",
        members: [
          { name: "آیدین نوربخش" },
          { name: "حسین عظیمی" },
          { name: "محسن اندایش" },
          { name: "حسین عطایی" },
          { name: "مرتضی عباس‌نژاد" },
          { name: "اردلان شرافتی" },
          { name: "پرهام خشکباری" },
          { name: "مسعود خاکبازان", notes: "علی‌البدل" },
          { name: "حمید باطنی‌پور", notes: "علی‌البدل" }
        ]
      },
      {
        name: "دانشکده مهندسی صنایع (خرداد ۱۳۸۰)",
        members: [
          { name: "میثاق تصوری", role: "مسئول آموزشی" },
          { name: "نیما شیروانی" },
          { name: "مهدی کیامهر" },
          { name: "حمیدرضا کوشا" },
          { name: "علی مجازی" },
          { name: "سارا زعیم‌دار" },
          { name: "اراز فیضی" },
          { name: "محب زندی‌نژاد" },
          { name: "روح‌الله داد‌خواه", notes: "علی‌البدل" },
          { name: "یلدا امیری", notes: "علی‌البدل" }
        ]
      },
      {
        name: "دانشکده مهندسی شیمی",
        members: [],
        notes: "انتخابات به علت به حد نصاب نرسیدن کاندیدها برگزار نشد"
      },
      {
        name: "دانشکده فیزیک",
        members: [
          { name: "حنیف بیات موحد" },
          { name: "ابوذر شیرزاد" },
          { name: "علی تابعی" },
          { name: "مهدی‌صارمی‌فر" },
          { name: "آرزو منصوری" },
          { name: "گلنوش بیژنی", notes: "علی‌البدل" },
          { name: "محمد امین واصفی", notes: "علی‌البدل" }
        ]
      },
      {
        name: "دانشکده مهندسی مواد",
        members: [],
        notes: "انتخابات به علت مشغول «همایش مواد ۸۰» برگزار نشد"
      },
      {
        name: "دانشکده مهندسی برق",
        members: [
          { name: "پویا دهقانی" },
          { name: "مریم سلطان‌زاده" },
          { name: "پدرام خلیلی امیری" },
          { name: "احسان شاه‌حسینی" },
          { name: "احسان حقانی" },
          { name: "مجید پورکاشانی" },
          { name: "دریا یونسی" },
          { name: "آریا فلاحی", notes: "علی‌البدل" },
          { name: "آرش زاهدی", notes: "علی‌البدل" }
        ]
      },
      {
        name: "دانشکده شیمی",
        members: [],
        notes: "انتخابات به علت عدم ثبت‌نام حتی یک کاندید، برگزار نشد"
      },
      {
        name: "خوابگاه زنجان (احمدی‌روشن)",
        members: [
          { name: "فرهاد رجبی" },
          { name: "پیمان حیدری" },
          { name: "ابوالحسن شمس" },
          { name: "رضا بیجه" },
          { name: "بهزاد هوشمند" },
          { name: "سعید حسن‌زاده", notes: "علی‌البدل" },
          { name: "مصطفی نقوی", notes: "علی‌البدل" }
        ]
      },
      {
        name: "خوابگاه طرشت ۳ (۱۸ اردیبهشت ۱۳۸۰)",
        members: [
          { name: "امیر امین‌زاده" },
          { name: "داریوش پور سراجیان" },
          { name: "عباس ترابی" },
          { name: "هاشم حیدری" },
          { name: "بهزاد بهبرانی" },
          { name: "مجید تقوی", notes: "علی‌البدل" },
          { name: "علی بحرانی", notes: "علی‌البدل" },
          { name: "محمد خسروی", notes: "علی‌البدل" }
        ]
      },
      {
        name: "خوابگاه طرشت ۲ (۳۰ اردیبهشت ۱۳۸۰)",
        members: [
          { name: "آیلر پورمحمد" },
          { name: "عاطفه قانع" },
          { name: "یلدا کاتبی" },
          { name: "راضیه خلیفه‌زاده", notes: "علی‌البدل" },
          { name: "زهره معتضد", notes: "علی‌البدل" }
        ]
      },
    ]
  },
  {
    meta: {
      period: 0,
      year: "۸۱-۸۲",
      faTitle: "دوره صفر (سال ۸۱-۸۲)",
      description: "آغاز شورای مرکز؛ اولین ترکیب نسبتاً سراسری. دبیر: میثاق تصوری"
    },
    units: [
      {
        name: "شورای مرکز",
        members: [
          { name: "میثاق تصوری", role: "دبیر" }
        ]
      },
      {
        name: "دانشکده مهندسی کامپیوتر",
        members: [
          { name: "احسان فروغی", role: "دبیر (Vice Chair)" },
          { name: "مهران معتمد", role: "نائب‌دبیر (Chair)" },
          { name: "محمد نصر" },
          { name: "حسین صفرالله" },
          { name: "امین صارمی" },
          { name: "میثم سیدیان" },
          { name: "فرناز آزموده", role: "منشی (Secretaryّ)" },
          { name: "عاطفه میرسفیان" },
          { name: "الناز صدرموسویان" }
        ],
        links: ["https://web.archive.org/web/20030221011303/http://ce.sharif.edu/~shora/"]
      },
      {
        name: "دانشکده مهندسی برق (۱۲ و ۱۳ خرداد ۱۳۸۱)",
        members: [
          { name: "مریم سلطان زاده" },
          { name: "محمد حکمت" },
          { name: "محمدعلی هنرور" },
          { name: "سیدامیر میرطاهری" },
          { name: "شیرین اقتصادی" },
          { name: "پویا دهقانی" },
          { name: "جواد شعبانی" },
          { name: "نیما صادقی" },
          { name: "سیدعلی میرطاهرنظر" },
          { name: "علی ایازی", notes: "علی البدل" }
        ]
      },
      {
        name: "دانشکده مهندسی مواد (۷-۸ اردیبهشت ۱۳۸۱)",
        members: [
          { name: "احسان صائب نوری" },
          { name: "وحید فیروز در" },
          { name: "نسیم صحرایی" },
          { name: "محمد ملکی پور", notes: "علی البدل" }
        ]
      },
      {
        name: "دانشکده ریاضی (آذر ۸۱)",
        members: [
          { name: "رویا کریمیان", notes: "کارشناسی ارشد ۷۹" },
          { name: "حمید شکاری", notes: "ورودی ۷۹" },
          { name: "کیوان صادقی", notes: "ورودی ۸۰" },
          { name: "فرزان روحانی", notes: "ورودی ۷۹" },
          { name: "کیمیا قبادی", notes: "ورودی ۷۹" },
          { name: "ندا زارع نی نی", notes: "ورودی ۷۷، علی‌البدل" },
          { name: "حسام الدین عباسپور", notes: "ورودی ۷۹، علی‌البدل" }
        ]
      },
      {
        name: "دانشکده عمران (اردیبهشت ۱۳۸۱)",
        members: [
          { name: "آرمین نوربخش" },
          { name: "محسن اندایش" },
          { name: "حسین هاشمی" },
          { name: "مهدی وزیری" },
          { name: "سید محمد اصغرزاده" },
          { name: "رامین مرادی" },
          { name: "وحید مشتاق" },
          { name: "محمود کمال‌زاده", notes: "علی‌البدل" },
          { name: "حسین حق‌شناس", notes: "علی‌البدل" }
        ]
      },
      {
        name: "خوابگاه طرشت ۳",
        members: [
          { name: "سنکو خلقتی" },
          { name: "شروین قلی‌زاده" },
          { name: "دایی" }
        ]
      }
    ]
  },
  {
    meta: {
      period: 1,
      year: "۱۳۸۲–۱۳۸۳",
      faTitle: "دوره اول (سال ۸۲-۸۳)",
      description: `
        <a href="https://web.archive.org/web/20081202042441/http://ce.sharif.edu/~shora/site/asas.html" target="_blank">آرشیو وب‌سایت شورای صنفی کامپیوتر</a>
      `.replace(/\n\s+/g, "\n")
    },
    committees: [
      {
        name: "هیئت رئیسه",
        members: [
          { name: "علی کلانتریان", role: "دبیر" }
        ]
      },
      { name: "کمیته بوفه", members: [ { name: "صابر فلاح", role: "مسئول" } ] },
      { name: "کمیته رفاه دانشجویی", members: [ { name: "میثم میرعزیزی", role: "مسئول" } ] },
      { name: "کمیته آموزش", members: [ { name: "سهراب خطابخش", role: "مسئول" } ] },
      { name: "کمیته بهداری", members: [ { name: "سیما سلطانیان", role: "مسئول" } ] },
      { name: "کمیته کتابخانه و کپی", members: [ { name: "وحید مشتاق", role: "مسئول" } ] },
      { name: "کمیته سلف و تغذیه", members: [ { name: "تایماز نجفی", role: "مسئول" } ] },
      { name: "کمیته خدماتی و بهداشتی", members: [ { name: "امید ابراهیم‌زاده", role: "مسئول" } ] }
    ],
    units: [
      {
        name: "دانشکده مهندسی کامپیوتر",
        members: [
          { name: "پیروز چوبک", note: "ورودی ۷۹" },
          { name: "احسان نوربخش", note: "ورودی ۷۹" },
          { name: "مجتبی ترک جزی", note: "ورودی ۸۰" },
          { name: "محمد خبازهای تاجر", note: "ورودی ۸۰" },
          { name: "سید صفا محمودیان", note: "ورودی ۸۰" },
          { name: "سامان برقی", note: "ورودی ۸۱" },
          { name: "محمدرضا مرشدی", note: "ورودی ۸۱" },
          { name: "محمد مهدی جمشیدی", note: "ورودی ۸۲؛ احتمالاً علی‌البدل" },
          { name: "مریم دانشی", note: "ورودی ۸۲؛ احتمالاً علی‌البدل" }
        ]
      },
      {
        name: "دانشکده مهندسی مکانیک",
        members: [
          { name: "علی کلانتریان", note: "ورودی ۷۸ کارشناسی و ۸۲ ارشد مکانیک" }
        ]
      },
      {
        name: "دانشکده مهندسی برق",
        members: []
      },
      {
        name: "دانشکده مهندسی عمران",
        members: [
          { name: "وحید مشتاق" }
        ]
      },
      { name: "دانشکده مهندسی هوافضا", members: [] },
      { name: "دانشکده مهندسی صنایع", members: [] },
      { name: "دانشکده مهندسی شیمی و نفت", members: [] },
      {
        name: "دانشکده مهندسی و علم مواد",
        members: [
          { name: "میثم میرعزیزی" }
        ]
      },
      { name: "دانشکده فیزیک", members: [] },
      { name: "دانشکده ریاضی", members: [] },
      {
        name: "دانشکده شیمی",
        members: [
          { name: "سیما سلطانیان" }
        ]
      },
      { name: "دانشکده مهندسی انرژی", members: [] },
      { name: "دانشکده مدیریت و اقتصاد", members: [] },
      {
        name: "خوابگاه شهید احمدی روشن (زنجان)",
        members: [
          { name: "امید ابراهیم‌زاده", note: "مهندسی شیمی ۷۹" },
          { name: "فرزاد فرنود" }
        ]
      },
      { name: "خوابگاه طرشت ۳", members: [] },
      { name: "خوابگاه طرشت ۲", members: [] }
    ]
  },  
  {
    meta: {
      period: 2,
      year: "۱۳۸۳–۱۳۸۴",
      faTitle: "دوره دوم (سال ۸۳-۸۴)",
      description: `
      `.replace(/\n\s+/g, "\n")
    },
    committees: [
      {
        name: "هیئت رئیسه",
        members: [
          { name: "علی کلانتریان", role: "دبیر" }
        ]
      },
      { name: "کمیته بوفه", members: [ { name: "وحید مشتاق", role: "مسئول" } ] },
      { name: "کمیته کتابخانه", members: [ { name: "سمیه ملک‌پور", role: "مسئول" } ] },
      { name: "کمیته بهداری", members: [ { name: "احسان مقصودی", role: "مسئول" } ] },
      { name: "کمیته آموزش", members: [ { name: "امید ابراهیم‌پور", role: "مسئول" } ] }
    ],
    units: [
      {
        name: "دانشکده مهندسی کامپیوتر",
        members: [
          { name: "محمدرضا مرشدی", note: "ورودی ۸۱ گرایش نرم‌افزار؛ نماینده در مرکز" },
          { name: "مجتبی ترک جزی" },
          { name: "محسن حاجیلو" },
          { name: "مریم دانشی" },
          { name: "حسین تجری", note: "ورودی ۸۱ گرایش نرم‌افزار؛ نماینده در مرکز" },
          { name: "علی رحمانی" },
          { name: "سورنا ناصرمقدسی" },
          { name: "آبتین رسولیان", note: "علی‌البدل" },
          { name: "زینب برزگر", note: "علی‌البدل" },
          { name: "حنیف رهبری", note: "علی‌البدل" }
        ]
      },
      {
        name: "دانشکده مهندسی مکانیک",
        members: [
          { name: "علی کلانتریان" },
          { name: "علی فروزان" },
          { name: "مهدی شریفی" },
          { name: "محمد مجدم" },
          { name: "زینب حق‌دوست" },
          { name: "علی کلانتریان", note: "ورودی کارشناسی ۷۸ مکانیک و ۸۲ ارشد" },
          { name: "سیامک خرمی" },
          { name: "پیمان مستقیمی" },
          { name: "داود سلجوقی", note: "علی‌البدل" },
          { name: "فرزاد خادم‌الحسینی", note: "علی‌البدل" }
        ]
      },
      {
        name: "دانشکده مهندسی برق",
        members: [
          { name: "صمد احمدی" },
          { name: "فرانک اکبری فر" },
          { name: "آرش بهبودی" },
          { name: "عبدالصالح دادخواه" },
          { name: "محمد رهنمایی" },
          { name: "سیامک سرداری" },
          { name: "مونا زارعی" },
          { name: "محمد رضا سعادت" },
          { name: "مرتضی صادقی" },
          { name: "زینب صباغ" },
          { name: "اکرم کامرانی" },
          { name: "هیراد کریمی" },
          { name: "احمد محصل" },
          { name: "محمد مروتی" },
          { name: "امیر مقیمی" },
          { name: "رامین میری" }
        ]
      },
      {
        name: "دانشکده مهندسی عمران",
        members: [
          { name: "انام اردشیری" },
          { name: "اردلان شرافتی" },
          { name: "احمد جودی" },
          { name: "هومن بدایت" },
          { name: "پویا تیمورپور" },
          { name: "محمود زنگویی" },
          { name: "پیام رهنمای ذکاوت" },
          { name: "محمدرضا صبوری", note: "علی‌البدل" },
          { name: "شیرین مردانی", note: "علی‌البدل" }
        ]
      },
      { name: "دانشکده مهندسی هوافضا", members: [] },
      {
        name: "دانشکده مهندسی صنایع",
        members: [
          { name: "امیر علمی" },
          { name: "نسیم عقیلی" },
          { name: "کتایون سلامتی" },
          { name: "امید مداح" },
          { name: "احسان ناصری" },
          { name: "نرگس شیروانی" },
          { name: "فرساد صداقتی" },
          { name: "سارا فلاحی", note: "علی‌البدل" },
          { name: "حمید جهانیان", note: "علی‌البدل" }
        ]
      },
      {
        name: "دانشکده مهندسی شیمی",
        members: [
          { name: "اشکان یعقوبی آذری" },
          { name: "احسان وفا" },
          { name: "یوسف عزیزی" },
          { name: "عابد آفتابی" },
          { name: "مرتضی قدیریان" },
          { name: "نسیبه پورانصاری" },
          { name: "محسن شکوری" },
          { name: "مهدی قدمگاهی", note: "علی‌البدل" },
          { name: "محمدخلیلی تهرانی", note: "علی‌البدل" }
        ]
      },
      {
        name: "دانشکده مهندسی متالورژی",
        members: [
          { name: "مرتضی عمورضایی" },
          { name: "مریم کوکبی" },
          { name: "مریم سحابی" },
          { name: "میثم میرعزیزی" },
          { name: "فرزانه اردیفانی" },
          { name: "هادی آذر" },
          { name: "محمد نراقی" },
          { name: "امیر فرامرزی", note: "علی‌البدل" }
        ]
      },
      { name: "دانشکده فیزیک", members: [] },
      {
        name: "دانشکده ریاضی",
        members: [
          { name: "کارو صولت" },
          { name: "مریم کریمی" },
          { name: "محمد صفدری" },
          { name: "آرش سلیمانی" },
          { name: "اسفندیار خرم" },
          { name: "هومن طاهری نیا", note: "علی‌البدل" }
        ]
      },
      {
        name: "دانشکده شیمی",
        members: [
          { name: "افشین جباری" },
          { name: "مهناز نادری" },
          { name: "کیوان صدری" },
          { name: "آذر فرجام نیا" },
          { name: "فرید دهمامی" },
          { name: "افشین فتاح زاده" }
        ]
      },
      { name: "دانشکده مهندسی انرژی", members: [] },
      { name: "دانشکده مدیریت و اقتصاد", members: [] },
      {
        name: "خوابگاه شهید احمدی روشن (زنجان)",
        members: [
          { name: "امید ابراهیم‌زاده", note: "مهندسی شیمی ۷۹" }
        ]
      },
      {
        name: "خوابگاه طرشت ۳",
        members: [
          { name: "تایماز نجفی" }
        ],
        note: "کامنت فرهاد فرنود"
      },
      { name: "خوابگاه طرشت ۲", members: [] }
    ]
  },  
  {
    meta: {
      period: 3,
      year: "۱۳۸۴–۱۳۸۵",
      faTitle: "دوره سوم (سال ۸۴-۸۵)",
      description: `
        <a href="https://web.archive.org/web/20080614224041/http://ce.sharif.edu/~shora/" target="_blank">آرشیو وب‌سایت شورای صنفی کامپیوتر</a>
      `.replace(/\n\s+/g, "\n")
    },
    committees: [
      {
        name: "هیئت رئیسه",
        members: [
          { name: "محسن دهنوی", role: "دبیر" },
          { name: "علی عبدی", role: "نائب دبیر" },
          { name: "شیرین مردانی", role: "مسئول مالی" }
        ]
      }
      // کمیته‌های تخصصی در منابع پیدا نشد؛ قابل افزوده شدن
    ],
    units: [
      {
        name: "دانشکده مهندسی کامپیوتر",
        members: [
          { name: "محمدرضا مرشدی", note: "ورودی ۸۱ گرایش نرم‌افزار" },
          { name: "حسین تجری", note: "ورودی ۸۱ گرایش نرم‌افزار" },
          { name: "ساجد میرعمادی", note: "ورودی ۸۱ گرایش نرم‌افزار" },
          { name: "مهسا حائری", note: "ورودی ۸۳ گرایش فناوری اطلاعات" },
          { name: "امین دهش", note: "ورودی ۸۳" },
          { name: "امین یزدانی", note: "ورودی ۸۳" },
          { name: "پیام واثقی", note: "ورودی ۸۳ گرایش فناوری اطلاعات" }
        ]
      },
      {
        name: "دانشکده مهندسی مکانیک",
        members: []
      },
      {
        name: "دانشکده مهندسی برق",
        members: [
          { name: "احمد محصل" }
        ]
      },
      {
        name: "دانشکده مهندسی عمران",
        members: [
          { name: "فرهاد فرنود" },
          { name: "عمار میرزائی" },
          { name: "امیر مداری" },
          { name: "بابک بهاءالدین" },
          { name: "شیرین مردانی" }
        ]
      },
      {
        name: "دانشکده مهندسی هوافضا",
        members: []
      },
      {
        name: "دانشکده مهندسی صنایع",
        members: []
      },
      {
        name: "دانشکده مهندسی شیمی و نفت",
        members: []
      },
      {
        name: "دانشکده مهندسی و علم مواد",
        members: []
      },
      {
        name: "دانشکده فیزیک",
        members: []
      },
      {
        name: "دانشکده ریاضی",
        members: []
      },
      {
        name: "دانشکده شیمی",
        members: []
      },
      {
        name: "دانشکده مهندسی انرژی",
        members: []
      },
      {
        name: "دانشکده مدیریت و اقتصاد",
        members: []
      },
      {
        name: "خوابگاه شهید احمدی روشن",
        members: []
      },
      {
        name: "خوابگاه طرشت ۳",
        members: [
          { name: "فرخ کاکایی" },
          { name: "محسن دهنوی" }
        ]
      },
      {
        name: "خوابگاه طرشت ۲",
        members: []
      }
    ]
  },  
  {
    meta: {
      period: 4,
      year: "۱۳۸۵–۱۳۸۶",
      faTitle: "دوره چهارم (سال ۸۵-۸۶)",
      description: `
      `.replace(/\n\s+/g, "\n")
    },
    committees: [
      {
        name: "هیئت رئیسه",
        members: [
          { name: "مهرداد خانی", role: "دبیر (تا میانه)" },
          { name: "فریدون طاهری", role: "دبیر از میانه و نائب دبیر" }
        ]
      }
      // کمیته‌های تخصصی برای این دوره در دسترس نیست
    ],
    units: [
      {
        name: "دانشکده مهندسی کامپیوتر",
        members: [
          { name: "امین دهش", email: "a.dehesh@gmail.com", note: "نام خط خورده است." },
          { name: "پریسا دلفانی", email: "p.delfani@yaho.com" },
          { name: "ضیاء الدین جلالی", email: "zia_jalali@yahoo.com" }
        ]
      },
      {
        name: "دانشکده مهندسی مکانیک",
        members: [
          { name: "محمد حسین بادامچی", email: "mhbadamchi@yahoo.com" }
        ]
      },
      {
        name: "دانشکده مهندسی برق",
        members: [
          { name: "محمد جلالیان", email: "majjal65@yahoo.com" },
          { name: "محمد رضا علی عسگری", email: "mraa1364@yahoo.com" }
        ]
      },
      {
        name: "دانشکده مهندسی عمران",
        members: [
          { name: "سیامک سهرابی", email: "siamak_m_s_1986@yahoo.com" },
          { name: "شیوا مردانی", email: "shv_mri@yahoo.com" },
          { name: "فرهاد فرنود", email: "far_farnood@yahoo.com" }
        ]
      },
      {
        name: "دانشکده مهندسی هوافضا",
        members: []
      },
      {
        name: "دانشکده مهندسی صنایع",
        members: [
          { name: "سید هادی نوربخش", email: "hd_noorbakhsh@yahoo.com" }
        ]
      },
      {
        name: "دانشکده مهندسی شیمی",
        members: [
          { name: "ستاره سجادی", email: "setareh.sjd@gmail.com" },
          { name: "علی رضا شاه کرمی", email: "alireza_sh_kr@yaho.com" },
          { name: "میثاق نادری", email: "mhbadamchi@yahoo.com" } // شاید اشتباه تایپی؛ اگر درست نیست خبر بده
        ]
      },
      {
        name: "دانشکده مهندسی و علم مواد",
        members: []
      },
      {
        name: "دانشکده فیزیک",
        members: [
          { name: "مهدی ابراهیمی کاهو" },
          { name: "محمد صادق فیض", email: "m_s_f_66@yahoo.com" }
        ]
      },
      {
        name: "دانشکده ریاضی",
        members: [
          { name: "هوشمند حسن‌نیا رودبنه", email: "hooshmand_hasannia@yahoo.com" },
          { name: "فریدون طاهری", email: "fereydoonster@gmail.com" }
        ]
      },
      {
        name: "دانشکده شیمی",
        members: []
      },
      {
        name: "دانشکده مهندسی انرژی",
        members: []
      },
      {
        name: "دانشکده مدیریت و اقتصاد",
        members: []
      },
      {
        name: "خوابگاه شهید زنجان (احمدی روشن)",
        members: [
          { name: "مهرداد خانی", email: "m.khani@yahoo.com" },
          { name: "علی قلی زاده", email: "gholizadeh_1984@yahoo.com" }
        ]
      },
      {
        name: "خوابگاه طرشت ۳",
        members: [
          { name: "فرخ کاکایی" }
        ]
      },
      {
        name: "خوابگاه طرشت ۲",
        members: [
          { name: "بهاره عباسی", email: "bahare.ab@yahoo.com" },
          { name: "لاله سمیعی", email: "isamii_60@yahoo.com" },
          { name: "ملیجه بیرجندی", email: "mona.birjandi@gmail.com" }
        ]
      }
    ]
  },  
  {
    meta: {
      period: 5,
      year: "۱۳۸۶–۱۳۸۷",
      faTitle: "دوره پنجم (سال ۸۶-۸۷)",
      description: `
        <b>در برخی واحدها نام اعضا یا کمیته‌ها در دسترس نیست.</b>
      `.replace(/\n\s+/g, "\n")
    },
    committees: [
      {
        name: "هیئت رئیسه",
        members: [
          { name: "علی قلی‌زاده", role: "دبیر" },
          { name: "فرهاد فرنود", role: "نائب دبیر" }
        ]
      }
      // اطلاعات کمیته‌های تخصصی در منابع داده نشده است
    ],
    units: [
      {
        name: "دانشکده مهندسی کامپیوتر",
        members: [
          { name: "البرز افلاطونیان" },
          { name: "حسن مومنیان" },
          { name: "مهراد عبدالرزاق" },
          { name: "عطیه صراف" },
          { name: "بنیامین تختایی" },
          { name: "میثم عقیقی" },
          { name: "هاله دیزجی" },
          { name: "مسعود مرادی", note: "علی‌البدل" }
        ]
      },
      {
        name: "دانشکده مهندسی مکانیک",
        members: [
          { name: "مهدی ادیب" },
          { name: "سینا عسگری نژاد" },
          { name: "محمد مهدی عطایی" },
          { name: "مصطفی حسن پناه" },
          { name: "امیر حسین هادی" },
          { name: "علیرضا فغانی نیا" },
          { name: "علیرضا کامرانیافر", note: "علی‌البدل" },
          { name: "معین جوادیان", note: "علی‌البدل" },
          { name: "سید جواد مرتضوی", note: "ابقایی" }
        ]
      },
      {
        name: "دانشکده مهندسی برق",
        members: [
          { name: "محمد رسولی" },
          { name: "امیررضا مشاری" },
          { name: "امید زبیری" },
          { name: "محمد طباطبایی فراشاهی" },
          { name: "جوانه محسنی" },
          { name: "محمدرضا ابطهی", note: "علی‌البدل" },
          { name: "هادی عطاران", note: "علی‌البدل" },
          { name: "احمد احمدیان" }
        ]
      },
      {
        name: "دانشکده مهندسی عمران",
        members: []
      },
      {
        name: "دانشکده مهندسی هوافضا",
        members: [
          { name: "حسین رجبی" },
          { name: "کاظم فیاض بخش" },
          { name: "ابراهیم روغنی زاد" },
          { name: "احسان عیسی زاده" },
          { name: "نگار نباتیا" },
          { name: "مسلم صبوری", note: "علی‌البدل" },
          { name: "زینب محبی", note: "علی‌البدل" }
        ]
      },
      {
        name: "دانشکده مهندسی صنایع",
        members: [
          { name: "کاظم کیال" },
          { name: "حسین قریشی" },
          { name: "سینا مدرسی" },
          { name: "سجاد مدرسی" },
          { name: "سارا حسین نژاد" },
          { name: "مرتضی هاشمی", note: "علی‌البدل" },
          { name: "امیر پیله ور", note: "علی‌البدل" }
        ]
      },
      {
        name: "دانشکده مهندسی شیمی",
        members: [
          { name: "کامران رهنما" },
          { name: "محمد امین صادقی" },
          { name: "محمد حسن پور فلاح" },
          { name: "حسین موسوی" },
          { name: "زینب داداشی" },
          { name: "شاهرخ لشگری", note: "علی‌البدل" },
          { name: "مسعود پوربزرگ", note: "علی‌البدل" }
        ]
      },
      {
        name: "دانشکده مهندسی و علم مواد",
        members: []
      },
      {
        name: "دانشکده فیزیک",
        members: [
          { name: "مهدی ابراهیمی" },
          { name: "رامین زندوکیلی" },
          { name: "محمد بیانی" },
          { name: "آروین فاطمی" },
          { name: "صادق رییسی" },
          { name: "فرنوش فرهپور", note: "علی‌البدل" },
          { name: "علیرضا فتح الهی", note: "علی‌البدل" }
        ]
      },
      {
        name: "دانشکده ریاضی",
        members: [
          { name: "هوشمند حسن‌نیا" }
        ]
      },
      {
        name: "دانشکده شیمی",
        members: [
          { name: "مریم زنگی" }
        ]
      },
      {
        name: "دانشکده مهندسی انرژی",
        members: []
      },
      {
        name: "دانشکده مدیریت و اقتصاد",
        members: []
      },
      {
        name: "خوابگاه شهید زنجان (احمدی روشن)",
        members: [
          { name: "علی قلی‌زاده" }
        ],
        note: "کامنت فرهاد فرنود"
      },
      {
        name: "خوابگاه طرشت ۳",
        members: [
          { name: "محمد عابدینی" }
        ]
      },
      {
        name: "خوابگاه طرشت ۲",
        members: []
      }
    ]
  },  
  {
    meta: {
      period: 6,
      year: "۱۳۸۷–۱۳۸۸",
      faTitle: "دوره ششم (سال ۸۷-۸۸)",
      description: `
      `.replace(/\n\s+/g, "\n")
    },
    committees: [
      {
        name: "هیئت رئیسه و کمیته حراست",
        members: [
          { name: "محمد رسولی", role: "دبیر و دبیر کمیته حراست" }
        ]
      },
      {
        name: "کمیته تغذیه",
        members: [
          { name: "مهدی شفیعی", role: "دبیر" },
          { name: "سپهر عابد مقاره" },
          { name: "افشین بزرگ نیا" }
        ]
      },
      {
        name: "کمیته رفاه و خدمات",
        members: [
          { name: "امیرعلی زنگی آبادی", role: "دبیر" },
          { name: "عباس معاذاللهی" },
          { name: "محسن علی وردی" },
          { name: "صادق توکلی" }
        ]
      },
      {
        name: "کمیته آموزش",
        members: [
          { name: "میرحسین موسوی", role: "دبیر" },
          { name: "علی اکبر ابوالحسنی" },
          { name: "حسین گودرزی" }
        ]
      },
      {
        name: "کمیته تاسیسات و اینترنت",
        members: [
          { name: "محمد باقر کارآموز", role: "دبیر" },
          { name: "غلامرضا اسفندانی" },
          { name: "حمید نجارزادگان" },
          { name: "مهرداد یوسف زاده" }
        ]
      },
      {
        name: "کمیته بهداری",
        members: [
          { name: "خانم ؟؟ توحیدی", role: "دبیر" },
          { name: "خانم ؟؟ داداشی" },
          { name: "محمد حسن پور" }
        ]
      },
      {
        name: "کمیته تربیت بدنی",
        members: [
          { name: "محمد حسین حسینی مشهدی", role: "دبیر" },
          { name: "محمد علی موسوی" },
          { name: "محمدعلی کارگر" }
        ]
      },
      {
        name: "کمیته روابط عمومی",
        members: [
          { name: "بابک بهادری", role: "دبیر" },
          { name: "جواد سوهانکار" },
          { name: "امیرطه نائبی" }
        ]
      }
    ],
    units: [
      {
        name: "دانشکده مهندسی کامپیوتر",
        members: [
          { name: "مهراد عبدالرزاق", email: "manalo2005@gmail.com" },
          { name: "محمد جواد سوهانکار", email: "j.sohankar@gmail.com" },
          { name: "محمد علی کارگر", email: "makargar@gmail.com" },
          { name: "فرشته رزمی", email: "fe.razmi@gmail.com" },
          { name: "شاهین قره‌باغی", email: "shahin2202@gmail.com" },
          { name: "پویا سعادت‌پناه", email: "saadatpanah@gmail.com" },
          { name: "علیرضا صادقی‌پور", email: "alireza.sadeghipour.1988@gmail.com" }
        ]
      },
      {
        name: "دانشکده مهندسی مکانیک",
        members: [
          { name: "محمد علی موسوی" }
        ]
      },
      {
        name: "دانشکده مهندسی برق",
        members: [
          { name: "فرشاد قانعی" }
        ]
      },
      {
        name: "دانشکده مهندسی عمران",
        members: []
      },
      {
        name: "دانشکده مهندسی هوافضا",
        members: [
          { name: "محسن علی وردی" }
        ]
      },
      {
        name: "دانشکده مهندسی صنایع",
        members: [
          { name: "مهدی شفیعی" }
        ]
      },
      {
        name: "دانشکده مهندسی شیمی و نفت",
        members: [
          { name: "محمد امین صادقی" }
        ]
      },
      {
        name: "دانشکده مهندسی و علم مواد",
        members: [
          { name: "بابک بهادری" }
        ]
      },
      {
        name: "دانشکده فیزیک",
        members: [
          { name: "علی اکبر ابوالحسنی" }
        ]
      },
      {
        name: "دانشکده ریاضی",
        members: []
      },
      {
        name: "دانشکده شیمی",
        members: [
          { name: "حمید نجارزادگان" }
        ]
      },
      {
        name: "دانشکده مهندسی انرژی",
        members: []
      },
      {
        name: "دانشکده مدیریت و اقتصاد",
        members: [
          { name: "سپهر عابد مقاره" }
        ]
      },
      {
        name: "خوابگاه شهید زنجان (احمدی روشن)",
        members: [
          { name: "علیرضا رضوان‌دوست", role: "دبیر" },
          { name: "افشین بزرگ نیا" }
        ]
      },
      {
        name: "خوابگاه طرشت ۳",
        members: [
          { name: "هادی سالاری" }
        ]
      },
      {
        name: "خوابگاه طرشت ۲",
        members: [
          { name: "افروز فرجو" }
        ]
      }
    ]
  },  
  {
    meta: {
      period: 7,
      year: "۱۳۸۸–۱۳۸۹",
      faTitle: "دوره هفتم (سال ۸۸-۸۹)",
      description: `
      `.replace(/\n\s+/g, "\n")
    },
  
    committees: [
      {
        name: "هیئت رئیسه",
        members: [
          { name: "علیرضا رضواندوست", role: "دبیر" },
          { name: "مهرداد یوسف‌زاده", role: "مسئول مالی" }
        ]
      },
      {
        name: "کمیته آموزش",
        members: [{ name: "امیر مهدی تفرشیان", role: "دبیر" }]
      },
      {
        name: "کمیته بهداری و بهداشت",
        members: [{ name: "بهرنگ اسدی", role: "دبیر" }]
      },
      {
        name: "کمیته رفاه دانشجویان",
        members: [{ name: "ایوب خضرنژاد", role: "دبیر" }]
      },
      {
        name: "کمیته تغذیه",
        members: [{ name: "افشین بزرگ‌نیا", role: "دبیر" }]
      },
      {
        name: "کمیته تربیت بدنی",
        members: [{ name: "فاضل بنی‌اسدی", role: "دبیر" }]
      },
      {
        name: "کمیته خدمات و تاسیسات",
        members: [{ name: "علیرضا چراغی", role: "دبیر" }]
      },
      {
        name: "کمیته اینترنت",
        members: [{ name: "غلامرضا اسفندانی", role: "دبیر" }]
      },
      {
        name: "کمیته روابط عمومی",
        members: [{ name: "بابک بهادری", role: "دبیر" }]
      }
    ],
  
    units: [
      {
        name: "دانشکده مهندسی کامپیوتر",
        members: [
          { name: "رحمان لوایی مشهدی" },
          { name: "سعیده زحمت کش" }
        ]
      },
      {
        name: "دانشکده مهندسی مکانیک",
        members: [
          { name: "مهرداد یوسف زاده" },
          { name: "معین نظیفی" }
        ]
      },
      {
        name: "دانشکده مهندسی برق",
        members: [
          { name: "ارس شیخی" },
          { name: "جواد صالحی" }
        ]
      },
      {
        name: "دانشکده مهندسی عمران",
        members: [
          { name: "حسین کریمی" },
          { name: "آرش سلیمانی" },
          { name: "صادق قوامی" },
          { name: "امیر محمدی" },
          { name: "امیر حسین موسوی", note: "یا مجید لطفی؟" },
          { name: "مهدی زینانلو" },
          { name: "محمدرضا موسوی الملکی" }
        ],
        note: "اسامی عمران نامعتبر است و بر اساس نامه کار دانشجویی ۲۲ اسفند ۱۳۸۸ نوشته شده"
      },
      {
        name: "دانشکده مهندسی هوافضا",
        members: [
          { name: "فیروزه فروزان", role: "دبیر", email: "firoozeh.foroozan@gmail.com" },
          { name: "الهام فولادی", role: "مسئول مالی و نماینده واحد", email: "e.fouladi@gmail.com" },
          { name: "حمید ملکی" }
        ]
      },
      {
        name: "دانشکده مهندسی صنایع",
        members: [
          { name: "سید پویا علویان", role: "دبیر" },
          { name: "امیرمهدی تفرشیان" },
          { name: "امین زربخش" }
        ]
      },
      {
        name: "دانشکده مهندسی شیمی و نفت",
        members: [
          { name: "احمد سیاحتی" },
          { name: "حسین بمانا" },
          { name: "علی جمالی" },
          { name: "محمد هاشم حاج ابوالقاسم" }
        ]
      },
      {
        name: "دانشکده مهندسی و علم مواد",
        members: [
          { name: "بابک بهادری" },
          { name: "حسین گودرزی" }
        ]
      },
      {
        name: "دانشکده فیزیک",
        members: [
          { name: "آبتین کریمی" },
          { name: "هومن فرهنگ رنجبر" }
        ]
      },
      {
        name: "دانشکده ریاضی",
        members: [
          { name: "شراره زه تابیان" },
          { name: "سیاوش خداداده" },
          { name: "امین فارغ بال" }
        ]
      },
      {
        name: "دانشکده شیمی",
        members: [
          { name: "بهتاش شاکری" }
        ]
      },
      {
        name: "دانشکده مدیریت و اقتصاد",
        members: [
          { name: "سینا آقایی" }
        ]
      },
      {
        name: "خوابگاه زنجان",
        members: [
          { name: "افشین بزرگ نیا" },
          { name: "علیرضا چراغی" },
          { name: "علیرضا رضواندوست" }
        ]
      },
      {
        name: "خوابگاه مصلی نژاد",
        members: [
          { name: "هادی سالاری" }
        ]
      },
      {
        name: "خوابگاه طرشت ۳",
        members: [
          { name: "بهرنگ اسدی", role: "دبیر" },
          { name: "سجاد جلالی" },
          { name: "سپهر طباطبایی" },
          { name: "فاضل بنی اسدی" },
          { name: "مجتبی جمشیدی" },
          { name: "غلامرضا اسفندانی" },
          { name: "ایوب خضرنژاد" },
          { name: "محمد هادی امینی" },
          { name: "فضل‌الله ابراهیمی" }
        ]
      },
      {
        name: "خوابگاه طرشت ۲",
        members: [
          { name: "فاطمه السادات میرباقری", role: "دبیر شورا، مالی و مرکز مشاوره", email: "fatemehsadat.mirbagheri@gmail.com" },
          { name: "رویا محمدعلی پوراهری", role: "رابط و تربیت بدنی", email: "roya.ahari@gmail.com" },
          { name: "فریبا فرج‌بخش", role: "رابط، کتابخانه و اینترنت", email: "sonaffn@yahoo.com" },
          { name: "مینا صیدی اسفهلان", role: "کتابخانه و فیلم و فرهنگی", email: "mseidy@yahoo.com" },
          { name: "سیما روانبخش", role: "امور تاسیسات", email: "s_ravanbakhsh@yahoo.com" },
          { name: "ماندانا توکلیان", role: "امور مربوط به تغذیه", email: "mandana7t@yahoo.com" },
          { name: "فاطمه پورعمران", role: "سایت و فیلم و فرهنگی", email: "f.pouromran@yahoo.com" }
        ]
      }
    ]
  },  
  {
    meta: {
      period: 8,
      year: "۱۳۸۹–۱۳۹۱",
      faTitle: "دوره هشتم و نهم (سال ۸۹-۹۱)",
      description: `
در دی ماه ۱۳۸۹ انتخابات دوره هشتم برگزار شد و علیرضا رضوان‌دوست، دانشجوی ارشد رشته مدیریت مجددا به عنوان دبیر شورای صنفی دانشجویان انتخاب گردید. از میان سه نفر کاندیدای نایب دبیری: سیاوش خداداده، مهدی کرباسی و معین نظیفی نیز، معین نظیفی، دانشجوی ورودی ۸۷ رشته مهندسی مکانیک به عنوان نائب دبیر شورا انتخاب گردید. کاندیدای مسئولیت مالی شورای صنفی نیز تنها یک نفر بود و احمد سیاحتی، دانشجوی ارشد نفت به عنوان مسئول مالی شورا انتخاب شد و انتخاب دبیر کمیته‌ها به جلسه بعدی موکول شد. (براساس شماره ۱۸ نشریه شورا که در ۳ اسفند ۱۳۸۹ منتشر گردیده)
<br/>
سپس با استعفای علیرضا رضواندوست از مسئولیت دبیری شورا و با رای‌گیری مجدد، آقای بابک بهادری، دانشجوی دانشکده مهندسی مواد به عنوان دبیر جدید شورای صنفی دانشجویان انتخاب گردید. (بر اساس شماره ۱۹ نشریه شورا که در ۴ اردیبهشت ۱۳۹۰ منتشر گردیده)
<br/>
طبق گفته جناب بابک بهادری، ایشان در اواخر تابستون ۱۳۹۰ استعفا داده و جناب سیاوش خداداده دبیر می‌شوند. (نشریه شورا - توصیه‌نامه ادوار - جلد اول)
<br/>
آذرماه ۱۳۹۰ برخلاف انتظارها به این بهانه که قرار است آیین‌نامه جدید شورا به زودی ابلاغ شود، انتخابات تا اطلاع ثانوی به تعویق می‌افتد (جزئیات بیشتر در شماره ۲۸ام نشریه شورا)
پس از پایان سال تحصیلی ۹۰-۹۱ دانشجویان عضو شورا برای دومین بار اقدام به برگزاری انتخابات نمودند که مقارن با سخت‌گیری‌های دانشگاه برای مسئله حجاب شد که اعضای شورا در این مرحله اقدام به جمع‌آوری امضا از دانشجویان در مخالفت با سخت‌گیری ‌ها و برخوردهای سلیقه‌ای نمودند که این مسئله هم بها‌نه‌ای شد تا انتخابات شورا باز هم عقب بیفتد.
اوایل خرداد ۱۳۹۱ نامه‌ای با این مضمون که شورای صنفی به دلیل انجام فعالیت‌های غیرصنفی تعلیق می‌باشد به دست دبیر شورا رسید و پس از انجام مذاکرات اعضای شورا با مسئولین، این نامه از درجه اعتبار ساقط گردید و تعلیق شورا برداشته شد.
نهایتا تجمعی برگزار شد و در آن تجمع درخواست برگزاری انتخابات شورای صنفی نیز مطرح شد و درنهایت در آذرماه سال ۱۳۹۱ انتخابات برگزار شد.

        `.replace(/\n\s+/g, "\n")
    },
  
    committees: [
      {
        name: "هیئت رئیسه",
        members: [
          { name: "بابک بهادری", role: "دبیر" },
          { name: "سیاوش خداداده", role: "دبیر (پس از استعفای بهادری)" },
          { name: "معین نظیفی", role: "نائب دبیر" },
          { name: "احمد سیاحتی", role: "مسئول مالی" }
        ]
      },
      {
        name: "کمیته آموزش",
        members: [
          { name: "علی نخبۀالفقهایی", role: "دبیر" }
        ]
      },
      {
        name: "کمیته بهداری و بهداشت",
        members: [
          { name: "شاهین میرزازاده", role: "دبیر" }
        ]
      },
      {
        name: "کمیته تاسیسات و اینترنت",
        members: [
          { name: "محین سلامی", role: "دبیر" }
        ]
      },
      {
        name: "کمیته تربیت بدنی",
        members: [
          { name: "مسعود فکری", role: "دبیر" }
        ]
      },
      {
        name: "کمیته تغذیه",
        members: [
          { name: "سیاوش خداداده", role: "دبیر" }
        ]
      },
      {
        name: "کمیته رفاه",
        members: [
          { name: "علی کریمان مقدم", role: "دبیر" }
        ]
      },
      {
        name: "کمیته روابط عمومی",
        members: [
          { name: "محمد قادری", role: "دبیر" }
        ]
      }
    ],
  
    units: [
      {
        name: "دانشکده مهندسی کامپیوتر",
        members: [
          { name: "امین(بهروز) سوزنی", role: "دبیر" },
          { name: "حسین اسفندیاری" },
          { name: "مرتضی رمضانی" },
          { name: "سحر هراتی" },
          { name: "سعیده تبریزچی" },
          { name: "حمید(نوید) اعظمی" },
          { name: "علیرضا رضایی" },
          { name: "نوید اعظمی" }
        ]
      },
      {
        name: "دانشکده مهندسی مکانیک",
        members: [
          { name: "علی رشاد" },
          { name: "یحیی علمدار" },
          { name: "وهاب زارعی" },
          { name: "حسین کاظمی" },
          { name: "حمید گنجی" },
          { name: "نوید نظری" },
          { name: "روزبه دانایی" }
        ]
      },
      {
        name: "دانشکده مهندسی برق",
        members: [
          { name: "ارس شیخی", note: "عضو ابقایی" },
          { name: "سید مهدی قریشی" },
          { name: "فاطمه نجات بخش" },
          { name: "نیما بنی اسدی" },
          { name: "محمد قادری" },
          { name: "فرشاد قانعی" },
          { name: "محمدمهدی محاوری" },
          { name: "محمداحسان منصوری", note: "علی البدل" },
          { name: "حامد ولی پور", note: "علی البدل" }
        ]
      },
      {
        name: "دانشکده مهندسی عمران",
        members: [
          { name: "حسین کریمی", note: "ابقایی" },
          { name: "صادق قوامی", note: "ابقایی" },
          { name: "امیر محمدی", note: "ابقایی" },
          { name: "آرش سلیمانی" },
          { name: "محمدحسین حسنی" },
          { name: "علی شفیعیون" },
          { name: "سعید توکلی" },
          { name: "مهدی زینانلو", note: "علی البدل" },
          { name: "بهداد مفرج کوچکی", note: "علی البدل" }
        ]
      },
      {
        name: "دانشکده مهندسی هوافضا",
        members: [
          { name: "فیروز فروزان", note: "عضو ابقایی", email: "firoozeh.foroozan@gmail.com" },
          { name: "الهام فولادی", email: "e.fouladi@gmail.com" },
          { name: "سینا طاهری" },
          { name: "مهدی سعیدی پور" },
          { name: "علی نخبه الفقهایی" },
          { name: "سید هورام صادقی", note: "علی البدل" },
          { name: "رضا خراسانی", note: "علی البدل" }
        ]
      },
      {
        name: "دانشکده مهندسی صنایع",
        members: [
          { name: "سید پویا علویان", role: "دبیر", note: "ابقا از دوره قبل", email: "pooya_alavian@yahoo.com" },
          { name: "آرمان جباری", role: "نماینده در شورای مرکزی - نفر اول", email: "arman.jabari@yahoo.com" },
          { name: "زهره موحد منش", email: "movahedmanesh.mahsa@yahoo.com" },
          { name: "مژگان گلشن تفتی", role: "مسئول مالی", email: "mojgan.golshan@yahoo.com" },
          { name: "سید مهدی کرباسی", role: "نماینده در شورای مرکزی - نفر دوم", email: "sm_karbasi@yahoo.com" },
          { name: "علی میرفندرسکی", email: "ali.mirfendereski@yahoo.com" },
          { name: "امیرمهدی تفرشیان", note: "علی البدل" },
          { name: "نگار نصیریانی", note: "علی البدل" }
        ]
      },
      {
        name: "دانشکده مهندسی شیمی و نفت",
        members: [
          { name: "عبدالوهاب راستگو", note: "مهندسی نفت" },
          { name: "شاهین میرزازاده", note: "مهندسی شیمی" },
          { name: "غلامرضا فلاح‌نژاد", note: "مهندسی نفت" },
          { name: "مهسا قاسمی", note: "مهندسی شیمی" },
          { name: "علی کریمیان", note: "مهندسی نفت" },
          { name: "احسان بنایان", note: "مهندسی شیمی" },
          { name: "مریم یوسفی", note: "مهندسی شیمی" },
          { name: "فرزاد مهجرانی", note: "علی البدل" },
          { name: "ساسان زارعی", note: "علی البدل" }
        ]
      },
      {
        name: "دانشکده مهندسی و علم مواد",
        members: [
          { name: "بابک بهادری", note: "عضو ابقایی" },
          { name: "امیر بشیر گنبدی" },
          { name: "ماهور مهدی خانی" },
          { name: "بهزاد بهمن نژاد" },
          { name: "محمود سرکاری" },
          { name: "شبنم رجبی", note: "علی البدل" },
          { name: "فواد سلیمانی", note: "علی البدل" }
        ]
      },
      {
        name: "دانشکده فیزیک",
        members: [
          { name: "پیمان ایرجی زاد" },
          { name: "مجتبی جعفر زادگان" },
          { name: "فرشاد اسماعیل زاده" },
          { name: "پروین تیموری" },
          { name: "فاطمه بندی اسدی" },
          { name: "محمد مهدی عزت آبادی پور" },
          { name: "کیارش رحمانی" },
          { name: "محمد حسین نیا" }
        ]
      },
      {
        name: "دانشکده ریاضی",
        members: [
          { name: "سیاوش خداداده", note: "ابقایی" },
          { name: "شراره زه تابیان", note: "ابقایی" },
          { name: "آرمان عیسی خانی" },
          { name: "محمد بزرگزاده" },
          { name: "آرش حدادان" },
          { name: "محمدحسین فخاران", note: "علی البدل" },
          { name: "معین شادرو", note: "علی البدل" }
        ]
      },
      { name: "دانشکده شیمی", members: [] },
      { name: "دانشکده مهندسی انرژی", members: [] },
      { name: "دانشکده مدیریت و اقتصاد", members: [] },
  
      {
        name: "خوابگاه شهید احمدی روشن",
        members: []
      },
      {
        name: "خوابگاه طرشت ۳",
        members: [
          { name: "محمدهادی امینی" },
          { name: "حسنعلی خجسته" },
          { name: "ایوب خضرنژاد" },
          { name: "امیر براتی" },
          { name: "احمد سیاحتی" },
          { name: "محمد گنج" },
          { name: "مسعود فکری" },
          { name: "افشین پوینده" },
          { name: "سید مهدی بنی طبا" },
          { name: "بهروز اکبرپور بروجنی", note: "علی البدل" },
          { name: "سجاد جلالی ور", note: "علی البدل" }
        ]
      },
      {
        name: "خوابگاه طرشت ۲",
        members: [
          { name: "ماندانا توکلیان" },
          { name: "اکرم انتظاری" },
          { name: "ندا افضلی" },
          { name: "نعیمه امیدوار" },
          { name: "الهه جویبار" },
          { name: "ندا رأفت" },
          { name: "سارا نادری" },
          { name: "فهیمه شوروزی", note: "علی البدل" },
          { name: "فریبا جهانمردی", note: "علی البدل" }
        ]
      },
      {
        name: "خوابگاه شهید وزوایی‌",
        members: [
          { name: "وحید فهیم پور", note: "عضو ابقایی" },
          { name: "محسن سلامی" },
          { name: "مجید حق شناس" },
          { name: "رامین یوسفی" },
          { name: "مصطفی آری" },
          { name: "مجتبی منصوریانفر" },
          { name: "حسن قاسمی", note: "علی البدل" },
          { name: "علیرضا ابراهیمی", note: "علی البدل" }
        ]
      },
      {
        name: "خوابگاه شهرک",
        members: [
          { name: "عطااله کامیابی" },
          { name: "بهنام محمدی" },
          { name: "محمد علی داستان" },
          { name: "محمد عابدینی" },
          { name: "محمد ملایی امامزاده" },
          { name: "حسن اله داغی", note: "علی ‌البدل" }
        ]
      },
      {
        name: "خوابگاه مصلی‌نژاد",
        members: [
          { name: "هادی سالاری" },
          { name: "عباس قاسم پور" },
          { name: "محسن پادروند" },
          { name: "مجتبی گلشنی" },
          { name: "مهدی خزاعی نژاد" },
          { name: "حامد اکبرزاده", note: "علی البدل" },
          { name: "حامد پیری مقدم", note: "علی البدل" }
        ]
      },
      {
        name: "خوابگاه زنجان",
        members: [
          { name: "علیرضا رضواندوست" },
          { name: "نادر رضایی" },
          { name: "علیرضا چراغی" },
          { name: "علی علیزاده" },
          { name: "رضا کاردر رستمی" },
          { name: "احسان عباسی" },
          { name: "معین فلاحتگر" },
          { name: "فرید علی نژاد", note: "علی البدل" },
          { name: "بهداد ابرار", note: "علی البدل" }
        ]
      }
    ]
  },  
  {
  meta: {
    period: 10,
    year: "۱۳۹۱-۱۳۹۲",
    faTitle: "دوره دهم شورای صنفی (سال ۱۳۹۱-۱۳۹۲)",
    
    description: `شورا یک مرتبه در این دوره در نامه ۵۰۰۰-۹۸۹ توسط دکتر بهمن‌آبادی تعلیق شده است. جزئیات بیشتر در نامه ۵۰۰۲-۵۳۴.
    <br/>
همچنین اسامی کمیته‌‌ها براساس نامه ۵۰۰۲ـ۴۶۱ نوشته شده است.`,
  },
  committees: [
    {
    name: "هیئت رئیسه",
members: [
      { name: "محمد عصاریان نیاسری", role: "دبیر", type: "main" },
      { name: "احسان عباسی", role: "نائب دبیر", type: "main" }
    ],
    },
    {
      name: "کمیته رفاهی و تربیت بدنی",
      members: [
        { name: "سجاد پرویزی", role: "دبیر" },
        { name: "ساسان حاجی رضایی" },
        { name: "محمد جواد اکبری" },
        { name: "محمد عصاریان نیاسری" }
      ]
    },
    {
      name: "کمیته آموزشی",
      members: [
        { name: "علیرضا بدیعی", role: "دبیر" },
        { name: "مهران رفیعی آزاد" },
        { name: "محمدرضا عابدینی" },
        { name: "هاتف زمانی" }
      ]
    },
    {
      name: "کمیته تغذیه",
      members: [
        { name: "حجت اصغری", role: "دبیر" },
        { name: "امیر هارون زاده آرانی" },
        { name: "سجاد حاجی زاده" },
        { name: "سعیده علی نژاد" }
      ]
    },
    {
      name: "کمیته بهداری و بهداشت",
      members: [
        { name: "دل افروز میرفندرسکی", role: "دبیر" },
        { name: "آرمین ساعی" },
        { name: "محمد حسین زارعی" }
      ]
    },
    {
      name: "کمیته خدمات و IT",
      members: [
        { name: "رکسانا بالش زر", role: "دبیر" },
        { name: "احسان عباسی" },
        { name: "علی قاسم زاده" },
        { name: "حسین کریمی" }
      ]
    },
    {
      name: "کمیته خوابگاه",
      members: [
        { name: "محمد عباسی", role: "دبیر" },
        { name: "مهدیس نجات نیا" },
        { name: "جواد محبی" }
      ]
    },
    {
      name: "کمیته تاسیسات",
      members: [
        { name: "حمید سلیمانی", role: "دبیر" },
        { name: "مرتضی اخوان" },
        { name: "سید حامد مقیمی" }
      ]
    }
  ],
  units: [
    {
      name: "دانشکده مهندسی کامپیوتر",
      members: [{ name: "سید حامد مقیمی" }]
    },
    {
      name: "دانشکده مهندسی مکانیک",
      members: [{ name: "علی قاسم‌زاده" }]
    },
    {
      name: "دانشکده مهندسی برق",
      members: [{ name: "محمدرضا عابدینی" }]
    },
    {
      name: "دانشکده مهندسی عمران",
      members: [{ name: "حسین کریمی" }]
    },
    {
      name: "دانشکده مهندسی هوافضا",
      members: [{ name: "حیدرعلی ملکی" }],
      note: "احتمالا مانند مدیریت انتخابات در ۲۲ فروردین ۱۳۹۱"
    },
    {
      name: "دانشکده مهندسی صنایع",
      members: [{ name: "هاتف زمانی" }]
    },
    {
      name: "دانشکده مهندسی شیمی و نفت",
      members: [
        { name: "محمد عصاریان نیاسری" },
        { name: "مرتضی اخوان" }
      ]
    },
    {
      name: "دانشکده مهندسی و علم مواد",
      members: [{ name: "مهران رفیعی آزاد" }]
    },
    {
      name: "دانشکده فیزیک",
      members: [],
      note: "تشکیل نشد"
    },
    {
      name: "دانشکده ریاضی",
      members: [
        { name: "محمد جواد اکبری" },
        { name: "آرمین ساعی" }
      ]
    },
    {
      name: "دانشکده شیمی",
      members: [{ name: "علیرضا بدیعی" }]
    },
    {
      name: "دانشکده مهندسی انرژی",
      members: [],
      note: "تشکیل نشد"
    },
    {
      name: "دانشکده مدیریت و اقتصاد",
      members: [{ name: "حبیبه آناهید" }],
      note: "انتخابات در ۲۲ فروردین ۱۳۹۱"
    },
    {
      name: "خوابگاه شهید احمدی روشن",
      members: [
        { name: "احسان عباسی" },
        { name: "محمد عباسی" },
        { name: "سجاد پرویزی" }
      ]
    },
    {
      name: "خوابگاه طرشت ۳",
      members: [
        { name: "امیر هارون‌زاده آرانی" },
        { name: "ساسان حاجی رضایی" },
        { name: "حمید سلیمانی" },
        { name: "حجت اصغری" }
      ]
    },
    {
      name: "خوابگاه طرشت ۲",
      members: [
        { name: "رکسانا بالش‌زر" },
        { name: "دل افروز میرفندرسکی" },
        { name: "سعیده علی‌نژاد" }
      ]
    },
    {
      name: "خوابگاه آزادی",
      members: [{ name: "مهدیس نجات نیا" }]
    },
    {
      name: "خوابگاه شهید شوریده",
      members: [{ name: "جواد محبی" }]
    },
    {
      name: "خوابگاه مصلی‌نژاد",
      members: [{ name: "سجاد حاجی‌زاده" }]
    },
    {
      name: "خوابگاه شهرک",
      members: [{ name: "محمد حسین زارعی" }]
    },
    {
      name: "خوابگاه شادمان",
      members: [{ name: "مصطفی سام" }]
    }
  ]
},
  {
    meta: {'period': 11, 'year': '', 'faTitle': 'دوره یازدهم (سال ۹۲-۹۳)', description: `
اسامی و تعداد اعضا بر حسب رأی در شماره ۴۲ نشریه شورا آمده است، اما اینکه دقیقاً کدام یک از اعضا انتخاب شده‌اند و چه تعداد در هر واحد عضو رسمی هستند، مشخص نیست.
<br/>
طبق شماره ۵۸۱ روزنامه، واحدهای فیزیک، مدیریت و اقتصاد، هوافضا، مواد، خوابگاه‌های مصلی‌نژاد، آزادی، حیدرتاش، شادمان، وزوایی و شهرک به دلیل نرسیدن کاندیداها به حد نصاب تشکیل نشدند.
<br/>
احسان حقی در نتایج انتخابات (شماره ۴۲ نشریه شورا) به عنوان نماینده دانشکده انرژی انتخاب شد، اما بعدها به عنوان نماینده خوابگاه حیدرتاش معرفی شد که احتمالاً به دلیل نبود کاندید از آن خوابگاه، این مسئولیت را پذیرفته است.
<br/>
در شماره ۶۲۴ روزنامه ذکر شده که طبق آیین‌نامه، تمامی اعضا و همکاران منتخب، عضو شورای صنفی به حساب می‌آیند و مشخصات آمار اعضا و همکاران به شرح زیر است: دانشکده‌های بالای ۶۰۰ نفر جمعیت ۱ عضو و ۵ همکار، دانشکده‌های زیر ۶۰۰ نفر ۱ عضو و ۳ همکار، و خوابگاه‌های مختلف بین ۲ تا ۵ عضو دارند. همچنین، معمولاً نفر اول هر واحد به عضویت شورای مرکزی درمی‌آید.
<br/>
بر مبنای موارد فوق، اسامی اعضای شورا طبق شماره ۴۲ و فایل کاندیداها یادداشت شده اما از آن‌جا که در روزهای آغازین پس از انتخابات امکان انصراف و جایگزینی وجود داشته، در برابر اسامی غیرقطعی عبارت "احتمالاً" درج شده است. اسامی نمایندگان مرکز به طور مشخص ذکر شده است.
<br/>
همچنین مصطفی سام احتمالاً از دوره قبل، بدون شرکت رسمی در انتخابات، همچنان فعال باقی مانده است.
<br/>
بر اساس نامه ۵۰۰۲ـ۵۵۱، انتخابات مجدد دانشکده فیزیک برگزار شد و اسامی اعضا براساس آن تکمیل شده‌اند.
`
},
    committees: [
  {
    name: "هیئت رئیسه",
    members: [
      { name: "مهدی سیلاوی", role: "دبیر", type: "main" },
      { name: "ابوذر تمسکی", role: "نائب دبیر", type: "main" }
    ]
  }
  // اگر کمیته‌های تخصصی (آموزش، بهداشت، IT و...) را می‌خواهید، بهتر است اطلاعاتشان تکمیل شود یا بپرسید.
],
    units: [
  {
    name: "دانشکده مهندسی کامپیوتر",
    members: [
      { name: "سید حامد مقیمی", type: "main", email: "shmoghimi70@gmail.com", role: "نماینده در مرکز" },
      { name: "علی یادگاری", email: "ali.ydgr@gmail.com" },
      { name: "وحید امین تبار", email: "vahid.amintabar@gmail.com" },
      { name: "محمد امین صباغیان", email: "mmmdamin@gmail.com", role: "نماینده در مرکز" },
      { name: "محسن رشیدی", email: "mr.mperor72@gmail.com" },
      { name: "فرداد جلیلی تل چگاه", note: "احتمالا", email: "jalili.fardad@gmail.com" }
    ]
  },
  {
    name: "دانشکده مهندسی مکانیک",
    members: [
      { name: "رامتین کرامتی", type: "main", email: "ramtin.fcb1900@gmail.com", role: "نماینده در مرکز" },
      { name: "امین نقدلو", note: "احتمالا", email: "amin.naghdloo@gmail.com" },
      { name: "مهیار عابدی", note: "احتمالا", email: "phoneinorder5@yahoo.com" },
      { name: "امیرحسین ایزدی", note: "احتمالا", email: "amirhossein.v90@gmail.com" },
      { name: "حسانه کاظمی", note: "احتمالا", email: "andromeda.aryan@yahoo.com" },
      { name: "نوید دهداری ابراهیمی", note: "احتمالا", email: "navid3952@gmail.com" }
    ]
  },
  {
    name: "دانشکده مهندسی برق",
    members: [
      { name: "محمدرضا عابدینی", type: "main", role: "نماینده در مرکز", email: "abedini.mohamadreza@gmail.com" },
      { name: "مصطفی حسینی", note: "احتمالا", email: "mostafa.hosseini1372@yahoo.com" },
      { name: "فاطمه اصلان بیگی", note: "احتمالا", email: "f.aslanbeigi@yahoo.com" },
      { name: "علی رسته", note: "احتمالا", email: "ali.rasteh1@gmail.com" },
      { name: "سجاد صدیقی", note: "احتمالا", email: "sadjad4@gmail.com" },
      { name: "پیام مرسلی", note: "احتمالا", email: "payammorsali@yahoo.com" }
    ]
  },
  {
    name: "دانشکده مهندسی عمران",
    members: [
      { name: "حسین کریمی", type: "main", role: "نماینده در مرکز", email: "h.karimi.civil@gmail.com" },
      { name: "امین اسرافیلی", note: "احتمالا", email: "mr.esrafili@gmail.com" },
      { name: "علی شفیعیون", note: "احتمالا", email: "ashafieyoon@yahoo.com" },
      { name: "سید عباس جزایری", note: "احتمالا", email: "ajazayeri72@gmail.com" },
      { name: "سید مهدی فیروزی", note: "احتمالا", email: "mahdifiroozi843@yahoo.com" },
      { name: "رضا فیلی زاده", note: "احتمالا", email: "r.filizadeh@gmail.com" }
    ]
  },
  {
    name: "دانشکده مهندسی هوافضا",
    members: [
      { name: "سجاد کاظمی", note: "احتمالا غیررسمی یا انتصابی", email: "sajjadkazemi@ae.sharif.edu" }
    ]
  },
  {
    name: "دانشکده مهندسی صنایع",
    members: [
      { name: "هاتف زمانی", type: "main", role: "نماینده در مرکز", email: "hatef_nfs@yahoo.com" },
      { name: "عادل امین منصور", note: "احتمالا", email: "adelaminmansour@gmail.com" },
      { name: "احسان پوراسماعیلی", note: "احتمالا", email: "ehsanpuresmaili@yahoo.com" },
      { name: "محسن افکار", note: "احتمالا", email: "mohsen.afkar12@gmail.com" }
    ]
  },
  {
    name: "دانشکده مهندسی شیمی و نفت",
    members: [
      { name: "ماندانا توکلیان", type: "main", role: "نماینده در مرکز", email: "mandana.tavakolian@gmail.com" },
      { name: "ارغوان کیاکاظمی", note: "احتمالا", email: "arghavankiakazemi@gmail.com" },
      { name: "علی مطوری", note: "احتمالا", email: "alimatoori0094@gmail.com" },
      { name: "مهدی میرزایی حصاری", note: "احتمالا", email: "mahdi.mh1992@gmail.com" },
      { name: "سینا حسین پور ملکوتی", type: "main", role: "نماینده در مرکز", email: "sina.hpm@gmail.com" },
      { name: "ساسان حاجی رضایی", email: "hajirezaie@che.sharif.edu" },
      { name: "مرتضی کلهری", note: "احتمالا", email: "m.kalhori13@yahoo.com" }
    ]
  },
  {
    name: "دانشکده فیزیک",
    members: [
      { name: "آرمیتا وکیلی حاجی آقا", role: "نماینده در مرکز" },
      { name: "امیر علی حنایی" },
      { name: "سیده زهرا هجرتی" },
      { name: "فرنیک نیک اختر" },
      { name: "سارا علیقلی زاده صفری" }
    ]
  },
  {
    name: "دانشکده ریاضی",
    members: [
      { name: "نوید زارعی بزرگی", note: "احتمالا", email: "navidbozorgi@yahoo.com" },
      { name: "لعیا قدرتی", note: "احتمالا", email: "alya71@gmail.com" },
      { name: "سینا فردوسی", note: "احتمالا", email: "si_ferdowsi@hotmail.com" },
      { name: "امیر حسین زارع زاده", type: "main", role: "نماینده در مرکز", email: "amirhossein.zarezade@gmail.com" }
    ]
  },
  {
    name: "دانشکده شیمی",
    members: [
      { name: "محمد نجفی", email: "mohammad_najafi2001@yahoo.com" },
      { name: "ابوذر تمسکی", type: "main", role: "نماینده در مرکز", email: "abouzartamassoki@gmail.com" },
      { name: "رامین ربانی", note: "احتمالا", email: "ramin.rbbany@yahoo.com" },
      { name: "امیر توکلی", note: "احتمالا", email: "amir.icho@yahoo.com" }
    ]
  },
  {
    name: "دانشکده مهندسی انرژی",
    members: [
      { name: "حمیدرضا شمسی", type: "main", role: "نماینده در مرکز", email: "shamsi@energy.sharif.edu" },
      { name: "احسان حقی", type: "main", role: "نماینده خوابگاه حیدرتاش در مرکز", email: "haghiehsan@yahoo.com" },
      { name: "مرتضی برامکی", note: "احتمالا", email: "morteza.baramaki@yahoo.com" },
      { name: "محمدرضا معتمدی نژاد", note: "احتمالا", email: "mr.aria4030@gmail.com" }
    ]
  },
  {
    name: "دانشکده مدیریت و اقتصاد",
    members: [
      { name: "محبوبه توحیدی", note: "احتمالا غیررسمی یا انتصابی", email: "tohidi_mahboobeh@yahoo.com" }
    ]
  },
  {
    name: "خوابگاه شهید احمدی روشن",
    members: [
      { name: "موسی متقی مریدانی", type: "main", role: "نماینده در مرکز", email: "mousamottaghi@yahoo.com" },
      { name: "امیر بهادر موسوی", type: "main", role: "نماینده در مرکز", email: "amirbahador.moosavi@yahoo.com" },
      { name: "مصطفی شعبان پور", note: "احتمالا", email: "shabanpoor.mostafa@yahoo.com" }
    ]
  },
  {
    name: "خوابگاه طرشت ۳",
    members: [
      { name: "مهدی سیلاوی", type: "main", role: "نماینده در مرکز", email: "silavi.mahdi@gmail.com" },
      { name: "مرتضی ملکیان", role: "دبیر", email: "dr.rashkola@gmail.com" },
      { name: "سید محمد حسینی", type: "main", role: "نماینده در مرکز", email: "smhm227@yahoo.com" },
      { name: "علی فهیم نیا", email: "fahimniya@ce.sharif.edu" },
      { name: "محمدرضا رخ فروز", note: "احتمالا", email: "mrokhfrooz@ymail.com" }
    ]
  },
  {
    name: "خوابگاه طرشت ۲",
    members: [
      { name: "الهه جویبار", note: "احتمالا", email: "elaheh.jooybar@gmail.com" },
      { name: "حمیده ترکمندی", type: "main", role: "نماینده در مرکز", email: "hamideh.torkemandi70@gmail.com" },
      { name: "فرشته مظفری", type: "main", role: "نماینده در مرکز", email: "fereshteh.mozafari88@gmail.com" },
      { name: "الهام جبالبارزی", note: "احتمالا", email: "e.barezi@gmail.com" }
    ]
  },
  {
    name: "خوابگاه شادمان",
    members: [
      { name: "مصطفی سام", note: "احتمالا غیررسمی یا انتصابی", email: "mostafasamshirazi@gmail.com" }
    ]
  },
  {
    name: "خوابگاه شهید وزوایی",
    members: [
      { name: "محمد امین اسماعیلی", note: "احتمالا غیررسمی یا انتصابی", email: "mohammadaminesmaili@yahoo.com" }
    ]
  },
  {
    name: "خوابگاه شوریده",
    members: [
      { name: "سارا شاکری", note: "احتمالا غیررسمی یا انتصابی", email: "ssh.8768@gmail.com" }
    ]
  },
  {
    name: "خوابگاه متاهلی شهرک",
    members: [
      { name: "حسین جغتایی", note: "احتمالا غیررسمی یا انتصابی", email: "hossein.joghata@gmail.com" }
    ]
  },
  {
    name: "خوابگاه مصلی‌نژاد",
    members: [
      { name: "محمد اسلامی", type: "main", role: "نماینده در مرکز", email: "eslami_mohammad@ch.sharif.edu" },
      { name: "علی اکبر خرشاد", type: "main", role: "نماینده در مرکز", email: "khorshad@physics.sharif.edu" }
    ]
  },
  {
    name: "خوابگاه آزادی",
    members: [
      { name: "حسام میر فرح", note: "احتمالا غیررسمی یا انتصابی", email: "mirfarah_hesam@yahoo.com" }
    ]
  }
],
  },
  {
    meta: {'period': 12, 'year': '', 'faTitle': 'دوره دوازدهم (سال ۹۳-۹۴)',
        description: `
<a href="https://docs.google.com/document/d/1LNr0S2CnBdtzEWxV6Sc5fVip5GH3mUEN/edit?usp=drive_link&ouid=116316075639689918627&rtpof=true&sd=true" target="_blank" rel="noopener noreferrer">مشاهده منبع</a>
<br/>
نتایج انتخابات در شماره ۴۸ نشریه شورا مشخص است اما تعداد اعضای پذیرفته شده در هر دانشکده نامشخص است.
<br/>
طبق شماره ۶۲۸ روزنامه، دانشکده‌های هوافضا و انرژی و خوابگاه‌های مصلی‌نژاد و شهید وزوایی و حیدرتاش از لحاظ تعداد کاندیداهای شرکت در انتخابات به حد نصاب نرسیدند و انتخاباتی در کار نبود.
`


    },
    committees: [
  {
    name: "هیئت رئیسه",
    members: [
      { name: "مرتضی ملکیان", role: "دبیر و مسئول کمیته خدمات", email: "mortezamalekian93@gmail.com" ,  type: "main" },
      { name: "کیوان اسدلو", role: "نائب دبیر", type: "main"  }
    ]
  },
  { name: "کمیته رفاهی", members: [{ name: "عبدالرضا ارشادی نیا", role: "مسئول" }] },
  { name: "کمیته تربیت بدنی", members: [{ name: "نوید اثمری", role: "مسئول" }] },
  { name: "کمیته IT", members: [{ name: "پویا مصدق", role: "مسئول" }] },
  { name: "کمیته تاسیسات", members: [{ name: "رضا صفری", role: "مسئول" }] },
  { name: "کمیته امنیت", members: [{ name: "سعید ودادی کلانتری", role: "مسئول" }] },
  { name: "کمیته تغذیه", members: [{ name: "علی‌اکبر مومنی ملکشاه", role: "مسئول" }] },
  { name: "کمیته آموزش", members: [{ name: "یکتا یزدانی فرد", role: "مسئول" }] },
  { name: "کمیته بهداشت و درمان", members: [{ name: "اشکان ساکی", role: "مسئول" }] },
  { name: "کمیته خوابگاه‌ها", members: [{ name: "حمیده ترکمندی", role: "مسئول" }] },
  { name: "کمیته روابط عمومی", members: [{ name: "محمد اکبری منفرد", role: "مسئول" }] },
],
    units: [
  // دانشکده مهندسی کامپیوتر
  {
    name: "دانشکده مهندسی کامپیوتر",
    type: "unit",
    members: [
      { name: "پویا مصدق", entry: "۹۱", email: "pooya.mosaddegh72@gmail.com" },
      { name: "محسن رشیدی" },
      { name: "محمدامین صباغیان" },
      { name: "سید محمد رضی موسوی" },
      { name: "صالح وثوقی وحدت" }
    ]
  },
  // دانشکده مهندسی مکانیک
  {
    name: "دانشکده مهندسی مکانیک",
    type: "unit",
    members: [
      { name: "امین نقدلو", entry: "۹۰" },
      { name: "نوید اثمری سعدآباد", email: "navid.asmari@yahoo.com" },
      { name: "احسان میرعبداله" },
      { name: "امیرحسین ایزدی" },
      { name: "محمد مسعود قوام" }
    ]
  },
  // دانشکده مهندسی برق
  {
    name: "دانشکده مهندسی برق",
    type: "unit",
    members: [
      { name: "پوریا ماندی صنم", entry: "۹۱", email: "pourya.2374@live.com" },
      { name: "حنظله اکبری نودهی" },
      { name: "مصطفی محسن کبیر" },
      { name: "مهدی سیلاوی" },
      { name: "محمد استاد محمدی" }
    ]
  },
  // دانشکده مهندسی عمران
  {
    name: "دانشکده مهندسی عمران",
    type: "unit",
    members: [
      { name: "سروش سراوانی", entry: "۹۳ ارشد", email: "irisoroush@yahoo.com" },
      { name: "مصطفی سلیقه دوست", email: "mostafas2911@yahoo.com" },
      { name: "سید بهزاد خاتمی‌فرد" },
      { name: "رضا فیلی‌زاده", note: "شاید" },
      { name: "حبیب صادقی", note: "شاید" }
    ]
  },
  // دانشکده مهندسی صنایع
  {
    name: "دانشکده مهندسی صنایع",
    type: "unit",
    members: [
      { name: "یکتا یزدانی فرد", entry: "۹۱", email: "yektayazdanifard@yahoo.com" },
      { name: "محسن افکار" },
      { name: "میرحسین فتحی‌پور" },
      { name: "محمدباقر ظروف‌چی", note: "احتمالا" },
      { name: "حورا حسنی", note: "احتمالا" }
    ]
  },
  // دانشکده مهندسی شیمی و نفت
  {
    name: "دانشکده مهندسی شیمی و نفت",
    type: "unit",
    members: [
      { name: "معین محمودی", entry: "۹۰" },
      { name: "الیاس ارندان", email: "elyas.arandan@yahoo.com" },
      { name: "سینا کمالی" },
      { name: "محمد امیدی", note: "شاید" },
      { name: "مجتبی فنودی", note: "شاید" }
    ]
  },
  // دانشکده مهندسی و علم مواد
  {
    name: "دانشکده مهندسی و علم مواد",
    type: "unit",
    members: [
      { name: "رضا صفری", entry: "۹۰", email: "reza.safari93@gmail.com" },
      { name: "اشکان عزلتی", note: "شاید" },
      { name: "هلیا محمد کمال", note: "شاید" }
    ]
  },
  // دانشکده فیزیک
  {
    name: "دانشکده فیزیک",
    type: "unit",
    members: [
      { name: "فرنیک نیک اختر", entry: "۹۱", email: "farnik.nikakhtar@gmail.com" },
      { name: "فاطمه لیاقی", note: "شاید" },
      { name: "حمیدرضا شجاعی", note: "شاید" }
    ]
  },
  // دانشکده ریاضی
  {
    name: "دانشکده ریاضی",
    type: "unit",
    members: [
      { name: "آرمان عیسی خانی ممقانی", entry: "۹۳ ارشد" },
      { name: "امیرحسین اخلاصی" },
      { name: "محمد اکبری منفرد", email: "mohammad.akbarimonfared@gmail.com" },
      { name: "عرفان خانیکی", note: "احتمالا" },
      { name: "صالح سرشکی", note: "احتمالا" }
    ]
  },
  // دانشکده شیمی
  {
    name: "دانشکده شیمی",
    type: "unit",
    members: [
      { name: "اشکان ساکی", entry: "۹۲", email: "ashkansaaki@gmail.com" },
      { name: "فاطمه عابدی طامه" },
      { name: "پدرام توتونچیان" }
    ]
  },
  // دانشکده مدیریت و اقتصاد
  {
    name: "دانشکده مدیریت و اقتصاد",
    type: "unit",
    members: [
      { name: "سید علیرضا هاشمی", entry: "۹۲", email: "hashemii.alireza@gmail.com" },
      { name: "امیرحسین طاهری", note: "احتمالا" },
      { name: "نیما الفت", note: "احتمالا" }
    ]
  },
  // دانشکده مهندسی هوافضا (غیررسمی)
  {
    name: "دانشکده مهندسی هوافضا",
    type: "unit",
    members: [
      { name: "سید مهدی سیادتی", entry: "۹۰", note: "غیررسمی یا انتصابی", email: "sm.siadati@gmail.com" }
    ]
  },
  // دانشکده مهندسی انرژی (انتصابی)
  {
    name: "دانشکده مهندسی انرژی",
    type: "unit",
    members: [
      { name: "عباس ملک ثابت", entry: "۹۲ ارشد", note: "انتصابی" }
    ]
  },

  // خوابگاه‌ها
  {
    name: "خوابگاه شهید احمدی روشن",
    type: "dorm",
    members: [
      { name: "محمود فتح اله گودرزی", entry: "۹۰" },
      { name: "عبدالرضا ارشادی نیا", entry: "۹۰", email: "a.ershadinia@gmail.com" },
      { name: "کیوان اسدلو", entry: "۹۱", email: "keyvan32107@yahoo.com" }
    ]
  },
  {
    name: "خوابگاه طرشت ۳",
    type: "dorm",
    members: [
      { name: "سید محمد حسین معلم کلایی", entry: "۹۰" },
      { name: "مرتضی ملکیان", entry: "۹۰", email: "mortezamalekian93@gmail.com" },
      { name: "علی اکبر مومنی ملکشاه", entry: "۹۱", email: "a.a.momeni.m@gmail.com" },
      { name: "محمدحسین خوئینی", entry: "۹۱" },
      { name: "فرزاد قدیانلو", entry: "۹۱" }
    ]
  },
  {
    name: "خوابگاه طرشت ۲",
    type: "dorm",
    members: [
      { name: "فرخنده طاووسی گل", entry: "۹۲ ارشد" },
      { name: "فاطمه حسینی", entry: "۹۲ ارشد", email: "fhosseini40@yahoo.com" },
      { name: "حمیده ترکمندی", entry: "۹۲ ارشد", email: "hamideh.torkemandi70@gmail.com" },
      { name: "سارا اسدی", entry: "۹۲ ارشد" },
      { name: "الهه جویبار", entry: "۹۲ دکتری" }
    ]
  },
  {
    name: "خوابگاه شادمان",
    type: "dorm",
    members: [
      { name: "سعید ودادی کلانتری", entry: "۹۳ ارشد", email: "saeedkalantari89@gmail.com" }
    ]
  },
  {
    name: "خوابگاه شهید شوریده",
    type: "dorm",
    members: [
      { name: "صبا اثنی عشری", entry: "۹۲ ارشد" },
      { name: "مطهره شریفی نیا", entry: "۹۲ ارشد" },
      { name: "مریم السادات هاشمی", entry: "۹۲ ارشد", email: "maryam_hashemi_8844@yahoo.com" }
    ]
  },
  {
    name: "خوابگاه حیدرتاش",
    type: "dorm",
    members: [
      { name: "محمد ابراهیم نجاتیان", entry: "۹۲ ارشد", note: "غیررسمی - نامه ۵۰۰۲ـ۶۰۷", email: "mi.nejatian.put@gmail.com" }
    ]
  },
  {
    name: "خوابگاه شهرک دانشگاه",
    type: "dorm",
    members: [
      { name: "حسین جغتایی", entry: "۸۹", note: "احتمالا غیررسمی" }
    ]
  },
  {
    name: "خوابگاه آزادی",
    type: "dorm",
    members: [
      { name: "محسن دلشاد", note: "احتمالا غیررسمی", email: "delshadmohsen@yahoo.com" }
    ]
  },
  {
    name: "خوابگاه امراللهی",
    type: "dorm",
    members: [
      { name: "محسن رجایی", note: "احتمالا غیررسمی" }
    ]
  },
  {
    name: "خوابگاه مصلی نژاد",
    type: "dorm",
    members: [
      { name: "حسین طاهریان فرد", entry: "۹۳ دکتری", note: "غیررسمی یا انتصابی", email: "hoseintaherian26@yahoo.com" }
    ]
  },
  {
    name: "خوابگاه شهید وزوایی",
    type: "dorm",
    members: [
      { name: "فرامرز دولت آبادی", entry: "۹۳ ارشد", note: "غیررسمی یا انتصابی", email: "faramarz.dolat@gmail.com" }
    ]
  }
],
  },
  {
    meta: {'period': 13, 'year': '', 'faTitle': 'دوره سیزدهم (سال ۹۴-۹۶)', 'description': ''},
    committees: [
  {
    name: "شورای مرکزی دوره سیزدهم",
    members: [
      { name: "علی‌اکبر مومنی ملکشاه", role: "دبیر" },
      { name: "محمدعلی کرانی" },
      { name: "سامان هادیان" },
      { name: "علی مهدوی مطلق" },
      { name: "احسان کریمی" },
      { name: "سیدرضا فتاحی معصوم" },
      { name: "پیمان قهرمانی" },
      { name: "مینا باقری فرد" },
      { name: "هیراد عالی پناه" },
      { name: "سیدسپنتا منتظری" },
      { name: "محمدجواد نظری" },
      { name: "محمدجواد بابایی نیکو" },
      { name: "فرزاد قدیانلو" },
    ],
  },
],
    units: [
  {
    name: "دانشکده مهندسی کامپیوتر",
    type: "unit",
    members: [
      { name: "سامان هادیان", entry: "۹۳", role: "نماینده شورای مرکز", email: "Samiiiii1375@gmail.com" },
      { name: "محمدصدرا مرادیان", role: "دبیر" },
      { name: "سید امیرحسین حمیدیان", role: "تاسیسات" },
      { name: "محمدجعفر مشهدی ابراهیم", entry: "۹۱", role: "خدمات", email: "me@mjafar.me" },
      { name: "سید محمد حسینی", entry: "۹۳", role: "آموزش", email: "smhosseini@khedesh.ir" },
      { name: "رامتین یزدانیان", entry: "۹۱", role: "مالی و اموال", email: "Ramtin.yazdanian@gmail.com" },
      { name: "فرزانه هاشمی", entry: "۹۱", role: "روابط عمومی", email: "Farzane193@gmail.com" },
    ]
  },
  {
    name: "دانشکده مهندسی مکانیک",
    type: "unit",
    members: [
      { name: "میلاد حبیبی", entry: "۹۱", email: "Habibi.milad79@yahoo.com" },
      { name: "میثم بهمنی", entry: "۹۱", email: "Meysambahmani94@gmail.com" },
    ]
  },
  {
    name: "دانشکده مهندسی برق",
    type: "unit",
    members: [
      { name: "مصطفی محسنی کبیر", entry: "۹۱", role: "دبیر", email: "mohsenikabir@ee.sharif.edu" },
      { name: "هیراد عالی پناه", entry: "۹۳", email: "hirad.alipanah@gmail.com" },
      { name: "نادر مستعان", entry: "۹۲", email: "nadermostaan@gmail.com" },
      { name: "آفرین آقاسی زاده", entry: "۹۱", email: "a.aghassizadeh@gmail.com" },
      { name: "سارینا مداحی", entry: "۹۳", email: "Sarina.maddahi2@gmail.com" },
      { name: "سیدمعراج هاشمی زاده", entry: "۹۳", email: "merajhashemi@yahoo.com" },
      { name: "سپهر کریمی علویجه", entry: "۹۲", email: "Sepehrkarimi1@yahoo.com" },
    ]
  },
  {
    name: "دانشکده مهندسی عمران",
    type: "unit",
    members: [
      { name: "محمود طریقتی تابش", entry: "۹۴", role: "دبیر", email: "tabesh07@yahoo.com" },
      { name: "حسین امرالهی پورشیرازی", entry: "۹۱", email: "Hosseinamrollahi70@gmail.com" },
      { name: "محمدسعید محمودآبادی", entry: "۹۱", email: "Msaeedm1995@yahoo.com" },
    ]
  },
  {
    name: "دانشکده مهندسی هوافضا",
    type: "unit",
    members: [
      { name: "سیدرضا فتاحی معصوم", entry: "۹۱", role: "دبیر", email: "srezafattahim@gmail.com" },
      { name: "سید امیر حسین بااوسی", entry: "۹۱", email: "amirhosein.ae@gmail.com" },
      { name: "محمود محمدی", entry: "۹۲", email: "Ashiyane1994@gmail.com" },
      { name: "میلاد غیبی", entry: "۹۲", email: "gheibimilad@gmail.com" },
    ]
  },
  {
    name: "دانشکده مهندسی صنایع",
    type: "unit",
    members: [
      { name: "مهرداد پورقاسم", entry: "۹۳", role: "دبیر", email: "Pourghasem.mehrdad@gmail.com" },
      { name: "محمدعلی کرانی", entry: "۹۳", email: "Ma_korrani@yahoo.com" },
      { name: "نرگس محمدی", entry: "۹۲", email: "Nargesmohammadi13@yahoo.com" },
    ]
  },
  {
    name: "دانشکده مهندسی شیمی و نفت",
    type: "unit",
    members: [
      { name: "مریم آنالویی", entry: "۹۲", role: "دبیر", email: "Maryam.analoui9514@gmail.com" },
      { name: "علی مهدوی مطلق", entry: "۹۳", email: "Alimahdavi1511@gmail.com" },
      { name: "کورش حسامی اشرفی", entry: "۹۳", email: "Hesami_kourosh@yahoo.com" },
      { name: "علی کاظمی اصل", entry: "۹۳", email: "mg1374425@yahoo.com" },
      { name: "الهه شاکری", entry: "۹۲", email: "Elishakeri95@gmail.com" },
    ]
  },
  {
    name: "دانشکده مهندسی و علم مواد",
    type: "unit",
    members: [
      { name: "امید گوهری", entry: "۹۲", role: "دبیر", email: "Elishakeri95@gmail.com" },
      { name: "نگین سادات جلیلی", entry: "۹۲", email: "n.jalili@live.com" },
      { name: "احسان کریمی", entry: "۹۲", email: "Kehsan27@yahoo.com" },
    ]
  },
  {
    name: "دانشکده فیزیک",
    type: "unit",
    members: [
      { name: "اویس شیبانی", entry: "۹۲", role: "دبیر", email: "oveis.sheibani@yahoo.com" },
      { name: "فاطمه لیاقی", entry: "۹۲", email: "fatemehliaghi95@gmail.com" },
      { name: "لعیا قدسی", entry: "۹۳", email: "layaghodsi@gmail.com" },
    ]
  },
  {
    name: "دانشکده ریاضی",
    type: "unit",
    members: [
      { name: "سپهر ایمانی", entry: "۹۴", role: "دبیر", email: "sa_imani@yahoo.com" },
      { name: "سیدسپنتا منتظری", entry: "۹۴", email: "behrad.moeini9473@gmail.com" },
      { name: "بهراد معینی", entry: "۹۲", email: "3pi2pi@gmail.com" },
    ]
  },
  {
    name: "دانشکده شیمی",
    type: "unit",
    members: [
      { name: "مونا جهانی", entry: "۹۳", role: "دبیر", email: "Jahani.mona74@gmail.com" },
      { name: "مینا باقری فرد", entry: "۹۲", email: "minabagherifard@yahoo.com" },
    ]
  },
  {
    name: "دانشکده مهندسی انرژی",
    type: "unit",
    members: [
      { name: "محمدرضا الویری", entry: "۹۳ ارشد", role: "دبیر", email: "Peymangh2404@yahoo.com" },
      { name: "پیمان قهرمانی", entry: "۹۳ ارشد", email: "reza.alviri@yahoo.com" },
    ]
  },
  // دانشکده مدیریت و اقتصاد: داده‌ای موجود نیست

  // خوابگاه‌ها
  {
    name: "خوابگاه شهید احمدی روشن",
    type: "dorm",
    members: [
      { name: "محمدجواد نظری", entry: "۹۲ مهندسی شیمی و نفت", role: "دبیر", email: "javadhonom@gmail.com" },
      { name: "محمدجواد بابایی نیکو", entry: "۹۲ هوافضا", email: "mj.babaeenikoo@gmail.com" },
      { name: "کیوان اسدلو", entry: "۹۱ مهندسی شیمی و نفت", email: "Keyvan32107@yahoo.com" },
    ]
  },
  {
    name: "خوابگاه طرشت ۳",
    type: "dorm",
    members: [
      { name: "علی اکبر مومنی ملکشاه", entry: "۱۳۹۱ مهندسی برق", email: "a.a.momeni.m@gmail.com" },
      { name: "فرزاد قدیانلو", entry: "۹۱ مهندسی شیمی و نفت", email: "Farzad_ghadianlou@yahoo.com" },
      { name: "امیرمحمد بائو دیزآبادی", entry: "۹۱ مهندسی و علم مواد", email: "Mse.shd@gmail.com" },
    ]
  },
  {
    name: "خوابگاه شادمان",
    type: "dorm",
    members: [
      { name: "معین احمدی", entry: "۹۳ ارشد مهندسی انرژی", email: "moineahmadi@gmail.com" },
    ]
  },
  {
    name: "خوابگاه شوریده",
    type: "dorm",
    members: [
      { name: "نجمع سروری", entry: "۹۳ ارشد مهندسی و علم مواد", email: "Najme39@yahoo.com" },
    ]
  },
  {
    name: "خوابگاه طرشت ۲",
    type: "dorm",
    members: [
      { name: "الهه جویبار", entry: "۹۲ دکتری", email: "Elahe.jooybar@gmail.com" },
      { name: "سیده سارا صالحی", entry: "۹۲ دکتری", email: "Salehi.sara85@gmail.com" },
    ]
  },
  {
    name: "خوابگاه حیدرتاش",
    type: "dorm",
    members: [
      { name: "محسن ابراهیمی", entry: "۹۳ ارشد", email: "Mo_eb_ko@yahoo.com" },
    ]
  },
],
  },
  {
    meta: {'period': 14, 'year': '', 'faTitle': 'دوره چهاردهم (سال ۹۶-۹۷)', description: `
      بر اساس 
      <a href=https://t.me/dadesokhan/6763> این لینک </a>
انتخابات این شورا در ۱۸ بهمن ۱۳۹۵ برگزار شده و ۲۷ بهمن نتایج یعنی:
<a href=https://t.me/dadesokhan/6888> این لینک </a>
اعلام شده است. اما به دلایل نامعلوم، تا ۱۷ فروردین ۱۳۹۶ اعضای مرکز نامشخص بوده‌اند:
<a href=https://t.me/dadesokhan/7433> لینک </a>

      `},
    committees: [
  {
    name: "شورای مرکزی دوره چهاردهم",
    members: [
      { name: "پردیس صحرایی", role: "دبیر" },
      { name: "احسان کریمی" },
      { name: "سامان هادیان" },
      { name: "محمد صالحی" },
      { name: "احسان دلارامی فر" },
      { name: "نازیلا ویسی" },
      { name: "سینا رسولی" },
    ],
  },
],
    units: [
  {
    name: "دانشکده مهندسی کامپیوتر",
    type: "unit",
    members: [
      { name: "سامان هادیان", role: "دبیر" },
      { name: "حمید هاشمی", role: "نائب دبیر" },
      { name: "علی عسگری", role: "روابط عمومی" },
      { name: "علیرضا ظهری", role: "تاسیسات" },
      { name: "علی بهجتی", role: "فنی" },
      { name: "فاطمه (حورا) ابوطالبی", role: "آموزش" },
      { name: "محمدحسین ایرانپاک", role: "مالی و اموال" },
    ]
  },
  {
    name: "دانشکده مهندسی مکانیک",
    type: "unit",
    members: [
      { name: "سینا سعادت" },
      { name: "امیدرضا صفائی" },
      { name: "مهرداد داوودی" },
      { name: "داریوش افتخاری یزدی" },
      { name: "بهزاد خداقلیزاده" },
    ]
  },
  {
    name: "دانشکده مهندسی برق",
    type: "unit",
    members: [
      { name: "یاسمن سعیدی" },
      { name: "داوود صادق پور" },
      { name: "سهیل انصارین" },
      { name: "محمد امیررضایی" },
      { name: "وحید رستمخانی" },
      { name: "حسین محب زاده" },
      { name: "مرتضی عبدالله زاده" },
    ]
  },
  {
    name: "دانشکده مهندسی عمران",
    type: "unit",
    members: [
      { name: "محمدصادق نهانی ارشد" },
      { name: "سید روزبه موسوی" },
      { name: "علی امام قلی" },
      { name: "حسین پورعبدالله" },
      { name: "سیدشایان خالویی تفتی" },
    ]
  },
  {
    name: "دانشکده مهندسی هوافضا",
    type: "unit",
    members: [
      { name: "میلاد غیبی" },
      { name: "فاطمه رزمی" },
      { name: "مهدی جمشیدیها" },
      { name: "امیر ناظمی" },
      { name: "حجت اعتمادیان" },
    ]
  },
  {
    name: "دانشکده مهندسی صنایع",
    type: "unit",
    members: [
      { name: "پردیس صحرایی", role: "ارشد" },
      { name: "سید محمد هاشمی کروئی" },
      { name: "سارا نوری گلمائی" },
      { name: "پریسا کشاورز" },
      { name: "آزیتا جعفر بیگلو" },
    ]
  },
  {
    name: "دانشکده مهندسی شیمی و نفت",
    type: "unit",
    members: [
      { name: "احسان دلارامی فر", role: "دبیر" },
      { name: "علی حمزه", role: "نائب دبیر" },
      { name: "علیرضا معماریان" },
      { name: "ملیکا سلوکی" },
      { name: "سجاد باقری" },
      { name: "سیدحامد حسینی" },
      { name: "مهدی جعفری" },
    ]
  },
  {
    name: "دانشکده مهندسی و علم مواد",
    type: "unit",
    members: [
      { name: "احسان کریمی", role: "دبیر" },
      { name: "بهشته حلیمی" },
      { name: "مهسا یزدی فرد" },
      { name: "پونه فرحت" },
      { name: "علی بهرامی" },
    ]
  },
  {
    name: "دانشکده فیزیک",
    type: "unit",
    members: [
      { name: "محمد ابراهیمی", entry: "۹۴" },
      { name: "محسن مهرانی اردبیلی" },
      { name: "زهرا باقری" },
      { name: "نگار سیف" },
      { name: "محمدحسین جوان" },
    ]
  },
  {
    name: "دانشکده ریاضی",
    type: "unit",
    members: [
      { name: "سینا رسولی", role: "دبیر و تاسیسات دانشکده و کمدها" },
      { name: "علی ناصح", role: "امور فرهنگی" },
      { name: "ریحانه فالنجی", role: "روابط عمومی" },
      { name: "شایان اکبری", role: "آموزش و ورزش" },
      { name: "سید کوشان غلمانی" },
    ]
  },
  {
    name: "دانشکده شیمی",
    type: "unit",
    members: [
      { name: "نازیلا ویسی", role: "ارشد دبیر" },
      { name: "مونا جهانی" },
      { name: "امیرحسین رشیدی" },
    ]
  },
  {
    name: "دانشکده مهندسی انرژی",
    type: "unit",
    members: [
      { name: "علی پاسبان گجن" },
      { name: "سامان طاهری" },
      { name: "امیرحسین یوسفی" },
    ]
  },
  {
    name: "دانشکده مدیریت و اقتصاد",
    type: "unit",
    members: [
      { name: "علیرضا سهرابی زاده" },
      { name: "فاطمه بخشی" },
      { name: "مهدی رباب اسماعیلی" },
      { name: "ژاله انصاری پور" },
      { name: "مریم السادات مشتاقیان" },
    ]
  },
  // خوابگاه‌ها
  {
    name: "خوابگاه شهید احمدی روشن",
    type: "dorm",
    members: [
      { name: "محمد صالحی ابرقویی", role: "دبیر" },
      { name: "سیدمحمدجواد مظلومی زواره ای" },
      { name: "فرزین ساده لاری" },
      { name: "مصطفی روشنی" },
      { name: "محمد سقایت" },
    ]
  },
  {
    name: "خوابگاه طرشت ۳",
    type: "dorm",
    members: [
      { name: "سعید فرهادی" },
      { name: "سید حسن حسینی" },
      { name: "مهدی محسن آبادی" },
      { name: "محمدرضا تدینی" },
      { name: "بهزاد عبدی خانه سری" },
      { name: "محمدجواد شاکرآرانی" },
      { name: "علی اخلاصی نیا" },
    ]
  },
  {
    name: "خوابگاه طرشت ۲",
    type: "dorm",
    disabled: true,
    note: "این خوابگاه در این دوره تشکیل نشد.",
    members: []
  },
],
  },
  {
    meta: {'period': 15, 'year': '', 'faTitle': 'دوره پانزدهم (سال ۹۷-۹۸)', 'description': ''},
    committees: [
  {
    name: "شورای مرکزی دوره پانزدهم",
    members: [
      { name: "حسین محب‌زاده", role: "دبیر" },
      { name: "رسول قاسمی", role: "نائب دبیر و مسئول کمیته امنیت" },
      { name: "علی لطفی", role: "مسئول کمیته رفاهی، تاسیسات و خوابگاه" },
      { name: "وحید دانش", role: "مسئول کمیته آموزش" },
      { name: "سینا نادی", role: "مسئول کمیته تغذیه" },
      { name: "فاطمه امینی", role: "مسئول کمیته روابط عمومی و نشریه" },
      { name: "محمدرضا زارعی", role: "مسئول کمیته مالی" },
    ],
  },
],
    units: [
  {
    name: "دانشکده مهندسی کامپیوتر",
    type: "unit",
    members: [
      { name: "رسول قاسمی", entry: "۹۵", role: "دبیر" },
      { name: "محمد مهدی گرجی", role: "دبیر داخلی" },
      { name: "پارسا صلواتی", role: "نائب دبیر و فنی و مالی و اموال" },
      { name: "هدی ترابی", role: "روابط عمومی" },
      { name: "محمد امین عیسایی", role: "تاسیسات" },
      { name: "حورا ابوطالبی", role: "آموزش" },
      { name: "علی بابایی", role: "ورزش" },
    ]
  },
  {
    name: "دانشکده مهندسی مکانیک",
    type: "unit",
    members: [
      { name: "علی لطفی", entry: "۹۴", role: "دبیر و امور دفتری" },
      { name: "علی پارچه‌فروش", role: "آموزش" },
      { name: "رضا علی‌پور", role: "رسانه" },
      { name: "علی لاجوردی", role: "رسانه و تاسیسات" },
      { name: "علی منصوری", role: "رفاهی و تاسیسات" },
      { name: "امیر پویا حمصیان", role: "حقوقی و داده‌پردازی" },
      { name: "حمید حیدری‌مقدم", role: "نائب دبیر و امور مالی" },
    ]
  },
  {
    name: "دانشکده مهندسی برق",
    type: "unit",
    members: [
      { name: "حسین محب زاده", entry: "۹۴", role: "دبیر" },
      { name: "علیرضا حاجی قاسمی", role: "نائب دبیر و مسئول امور مالی" },
      { name: "محمد مهدی راستی کردار", role: "مسئول تاسیسات" },
      { name: "پارسا دلاوری", role: "مدیرمسئول مجله روشنا" },
      { name: "هانیه ساعی یکتا", role: "رابط شورای صنفی و رسانا و مسئول آموزش" },
      { name: "فرزانه عباسی", role: "مسئول روابط عمومی و مسئول آموزش" },
      { name: "مرتضی شمس", role: "مسئول تقسیم کمد و برگزاری نمایشگاه کتاب" },
    ]
  },
  {
    name: "دانشکده مهندسی عمران",
    type: "unit",
    members: [
      { name: "محمد رادسرشت", entry: "۹۴", role: "دبیر" },
      { name: "محمد علی حکمتیان", role: "مسئول کمیته تاسیسات" },
      { name: "بهاره خواجه پور", role: "مسئول کمیته آموزش" },
      { name: "امیر محمد شمسی", role: "مسئول کمیته روابط عمومی و رسانه" },
      { name: "محمد علی جزیرئیان", role: "مسئول امور مالی" },
    ]
  },
  {
    name: "دانشکده مهندسی هوافضا",
    type: "unit",
    members: [
      { name: "وحید دانش", entry: "۹۴", role: "دبیر و مسئول کمیته آموزش" },
      { name: "کیانا قزلباش", role: "مسئول کمیته رفاه" },
      { name: "ایلیانصیری‌زیبا", role: "مسئول کمیته فوق‌برنامه" },
    ]
  },
  {
    name: "دانشکده مهندسی صنایع",
    type: "unit",
    members: [
      { name: "سینا نادی", entry: "۹۵", role: "دبیر" },
      { name: "به‌آفرید محمد جعفری" },
      { name: "ابوالفضل باقری" },
      { name: "محمدحسن سیفدار" },
      { name: "زهرا دانایی" },
    ]
  },
  {
    name: "دانشکده مهندسی شیمی و نفت",
    type: "unit",
    members: [
      { name: "سولماز نافع", entry: "۹۵", role: "احتمالا دبیر" },
      { name: "علی کریم زاده" },
      { name: "حسام صمدی" },
      { name: "سمانه گودرزی" },
      { name: "سید مسعود سلیمانی" },
      { name: "محمد جواد ثقفی" },
      { name: "لعیا دلیر" },
    ]
  },
  {
    name: "دانشکده مهندسی و علم مواد",
    type: "unit",
    members: [
      { name: "دانیال حسینی", entry: "۹۵", role: "احتمالا دبیر" },
      { name: "فرناز نصیری" },
      { name: "فرزاد فتوحی" },
      { name: "علی محتشمی فر" },
      { name: "امید باقری" },
    ]
  },
  {
    name: "دانشکده فیزیک",
    type: "unit",
    members: [
      { name: "فاطمه امینی", entry: "۹۵", role: "دبیر و آموزش" },
      { name: "هومن زارع", role: "آموزش" },
      { name: "محمدمبین سعیدی", role: "تاسیسات و کمدها" },
      { name: "مریم آزادی طلب", role: "فرهنگی" },
      { name: "مجتبی علیان نژادی", role: "روابط عمومی" },
    ]
  },
  {
    name: "دانشکده ریاضی",
    type: "unit",
    members: [
      { name: "سید عطا ناقدی‌فر", entry: "۹۵", role: "دبیر" },
      { name: "زهرا نویدی", role: "نائب دبیر و روابط عمومی" },
      { name: "حسین مهدوی‌پور", role: "آموزش" },
      { name: "داوود خوشبختی", role: "تاسیسات و کمدها و ورزش" },
      { name: "فهیمه حسینی", role: "مالی" },
    ]
  },
  {
    name: "دانشکده شیمی",
    type: "unit",
    members: [
      { name: "امیرحسین رشیدی", entry: "۹۵", role: "دبیر" },
      { name: "محمد جواد آزادی مقدم" },
      { name: "دانیال سلطانی" },
      { name: "مهدی ناظریان" },
      { name: "غزل شفیعی" },
    ]
  },
  {
    name: "دانشکده مهندسی انرژی",
    type: "unit",
    members: [
      { name: "داوود نقوی دیزجی", role: "دانشجوی دکترا، احتمالا دبیر" },
      { name: "نوید جعفری" },
      { name: "میلاد شکراللهی" },
      { name: "ایران برزگر" },
      { name: "ژاله وطنی" },
    ]
  },
  {
    name: "دانشکده مدیریت و اقتصاد",
    type: "unit",
    note: "این دانشکده در این دوره تشکیل نشد.",
    disabled: true,
    members: []
  },
  // خوابگاه‌ها
  {
    name: "خوابگاه شهید احمدی روشن",
    type: "dorm",
    members: [
      { name: "محمدرضا زارعی", entry: "۹۵ مهندسی شیمی", role: "دبیر" },
      { name: "مصطفی روشنی" },
      { name: "محمدمتین باقری طادی" },
      { name: "محمد حسین احمدزاده" },
      { name: "سید حسین علوی" },
      { name: "مهدی امیر آبادی" },
      { name: "محمد امین محتشمی" },
    ]
  },
  {
    name: "خوابگاه طرشت ۳",
    type: "dorm",
    members: [
      { name: "محمدامین مودی", entry: "۹۶ مهندسی شیمی", role: "دبیر" },
      { name: "علی جعفری", role: "تاسیسات" },
      { name: "محمد مهدی سخایی", role: "اینترنت" },
      { name: "ایمان جبلت", role: "تغذیه" },
      { name: "محمد جواد جهانگیری", role: "امنیت" },
      { name: "آرش کیشان", role: "ورزش" },
      { name: "مهدی اطمینان", role: "بهداشت" },
    ]
  },
  {
    name: "خوابگاه طرشت ۲",
    type: "dorm",
    members: [
      { name: "مطهره سهرابی", entry: "۹۵ مهندسی کامپیوتر", role: "دبیر" },
      { name: "فاطمه هادی‌زاده", role: "تاسیسات" },
      { name: "زهرا اکبری", role: "اینترنت و کتابخانه" },
      { name: "نسترن جدیدی", role: "تغذیه" },
      { name: "زینب استاجی", role: "امنیت و حراست" },
      { name: "فائزه لباف", role: "ورزش و نشاط" },
      { name: "فرزانه لباف", role: "بهداشت" },
    ]
  },
],
  },
  {
    meta: {'period': 16, 'year': '', 'faTitle': 'دوره شانزدهم (سال ۹۸-۹۹)', 'description': ''},
    committees: [
  {
    name: "شورای مرکزی دوره شانزدهم",
    members: [
      { name: "محمد شهیدی", role: "دبیر" },
      { name: "علی کریم‌زاده", role: "نائب دبیر و کمیته تغذیه" },
      { name: "علیرضا بیک‌احمدی", role: "مسئول کمیته آموزش" },
      { name: "دانیال حسینی", role: "روابط عمومی" },
      { name: "محمدمهدی سخایی", role: "کمیته امنیت" },
      { name: "زهرا اکبری", role: "کمیته رفاهی" },
      { name: "سعید بهنود", role: "کمیته مالی-اداری" },
      { name: "فاطمه امینی", role: "مسئول نشریه و آسیب‌های اجتماعی" }
    ]
  }
],
    units: [
  {
    name: "دانشکده مهندسی کامپیوتر",
    type: "unit",
    members: [
      { name: "محمد شهیدی", entry: "۹۵", role: "دبیر" },
      { name: "امیرحسین هادیان", role: "دبیر داخلی" },
      { name: "سروش وفایی‌تبار", role: "نائب دبیر و اموال" },
      { name: "امیرحسین عاصم یوسفی", role: "تاسیسات" },
      { name: "حسین آقامحمدی", role: "آموزش" },
      { name: "ارشیا مقیمی", role: "آموزش" },
      { name: "محمد آذری", role: "مالی" },
      { name: "علی شیرمحمدی", role: "فنی" },
      { name: "مهدی حاجی‌محمدعلی" }
    ]
  },
  {
    name: "دانشکده مهندسی مکانیک",
    type: "unit",
    members: [
      { name: "علیرضا بیک‌احمدی", entry: "۹۶" },
      { name: "میلاد فاطمی" },
      { name: "نسترن سعادتی" },
      { name: "علی منصوری" },
      { name: "سید سهیل سیادتی" },
      { name: "عرفان بهالو" },
      { name: "نسیم حق‌دوست" },
      { name: "محمد یاوری" },
      { name: "محمد نعمتی" },
      { name: "ایمان پورپاک" }
    ]
  },
  {
    name: "دانشکده مهندسی برق",
    type: "unit",
    members: [
      { name: "محمد عرفان صادقی", role: "دبیر" },
      { name: "مرتضی شمس", role: "نائب دبیر و مسئول تاسیسات و تقسیم کمد" },
      { name: "علی محرابیان", role: "مسئول امور مالی" },
      { name: "پرهام محمدی", role: "مسئول مجله روشنا و نمایشگاه کتاب" },
      { name: "تینا خضر اسمعیل زاده", role: "مسئول مجله روشنا و نمایشگاه کتاب" },
      { name: "نفیسه عزیزی", role: "مسئول ارتباط با رسانا" },
      { name: "محمدحسین شعرا", role: "مسئول روابط عمومی" }
    ]
  },
  {
    name: "دانشکده مهندسی عمران",
    type: "unit",
    members: [
      { name: "سپهر سعیدی", entry: "۹۶", role: "دبیر" },
      { name: "بهاره خواجه پور", role: "آموزش" },
      { name: "محمد علی حکمتیان", role: "تاسیسات" },
      { name: "محمد علی جزیرئیان", role: "مالی" },
      { name: "امیرمحمد شمسی", role: "روابط عمومی" }
    ]
  },
  {
    name: "دانشکده مهندسی هوافضا",
    type: "unit",
    members: [
      { name: "امیر محمد احمدی", role: "دبیر" },
      { name: "حسام نوری", role: "آموزش" },
      { name: "زهراسادات سیدعلی", role: "رفاه" },
      { name: "جواد میرزایی", role: "رفاه" },
      { name: "محمدمسعود فولادی", role: "فوق برنامه" },
      { name: "برزین بانان", role: "رفاه" },
      { name: "علیرضا بخشی", role: "آموزش" }
    ]
  },
  {
    name: "دانشکده مهندسی صنایع",
    type: "unit",
    members: [
      { name: "محمدجواد اسلامی", entry: "۹۵", role: "دبیر" },
      { name: "زهرا باقریان", entry: "۹۵", role: "نائب دبیر و خدمات رفاهی" },
      { name: "امید موروثی", entry: "۹۶", role: "آموزش" },
      { name: "پارسا دولتی", entry: "۹۶", role: "آموزش" },
      { name: "حمیدرضا محمدیها", entry: "۹۵", role: "فرهنگی" },
      { name: "سید محمد نیک پرور", entry: "۹۶", role: "مالی" },
      { name: "محمد وطنی", entry: "۹۶", role: "رسانه" }
    ]
  },
  {
    name: "دانشکده مهندسی شیمی و نفت",
    type: "unit",
    members: [
      { name: "علی کریم‌زاده", entry: "۹۶", role: "دبیر و مسئول کمد" },
      { name: "سمانه گودرزی", role: "نائب دبیر" },
      { name: "محمدامین مودی", role: "کمیته آموزش" },
      { name: "امیرحسین آخوندی", role: "کمیته تاسیسات" },
      { name: "محمدجواد ثقفی", role: "مسئول روابط عمومی" },
      { name: "محمد مهدی بسطامی", role: "مسئول مالی" },
      { name: "مهدی حسینی" },
      { name: "مریم فروتن" }
    ]
  },
  {
    name: "دانشکده مهندسی و علم مواد",
    type: "unit",
    members: [
      { name: "دانیال حسینی", entry: "۹۵" }
    ]
  },
  {
    name: "دانشکده فیزیک",
    type: "unit",
    members: [
      { name: "فاطمه امینی", entry: "۹۵", role: "دبیر" },
      { name: "حنانه باقری", role: "مسئول فرهنگی" },
      { name: "رامتین ریحانی", role: "مسئول تاسیسات" },
      { name: "محمدحسین شریفی", role: "مسئول آموزش" },
      { name: "علی ماهانی", role: "مسئول روابط عمومی" }
    ]
  },
  {
    name: "دانشکده ریاضی",
    type: "unit",
    members: [
      { name: "سبحان ابراهیمی", entry: "۹۶", role: "دبیر" },
      { name: "سید علی هاشمی", role: "نائب دبیر و مسئول جلسات و مالی" },
      { name: "حنانه یعقوبی‌زاده", role: "آموزش و روابط عمومی" },
      { name: "متین حاجیان", role: "تاسیسات و کمد و اتاق" },
      { name: "محمد کشاورزفرد", role: "فرهنگی" },
      { name: "رضا باقری", role: "مستندسازی" },
      { name: "امید نوری‌عابد", role: "ورزش و کتابخانه" },
      { name: "سیدمهدی سجادیان‌فرد", role: "کانال" }
    ]
  },
  {
    name: "دانشکده شیمی",
    type: "unit",
    disabled: true,
    note: "در این دوره تشکیل نشد.",
    members: []
  },
  {
    name: "دانشکده مهندسی انرژی",
    type: "unit",
    members: [
      { name: "داوود نقوی", role: "دانشجوی دکترا" }
    ]
  },
  {
    name: "دانشکده مدیریت و اقتصاد",
    type: "unit",
    disabled: true,
    note: "در این دوره تشکیل نشد.",
    members: []
  },
  // خوابگاه‌ها
  {
    name: "خوابگاه شهید احمدی روشن",
    type: "dorm",
    members: [
      { name: "سعید بهنود", entry: "۹۶ هوافضا", role: "دبیر" },
      { name: "علی ایوبی گل", role: "مسئول سوله ورزشی" },
      { name: "وحید حیدری", role: "مسئول بهداشت و تاسیسات" },
      { name: "امید سامع", role: "مسئول اینترنت" },
      { name: "اکبر فاضل", role: "مسئول تغذیه" },
      { name: "مهدی عنایتی", role: "مسئول کتابخانه" }
    ]
  },
  {
    name: "خوابگاه طرشت ۳",
    type: "dorm",
    members: [
      { name: "مهدی سخایی", entry: "۹۶ مکانیک", role: "دبیر" },
      { name: "ایمان جبلت", role: "نائب دبیر و تغذیه" },
      { name: "امیر محمد فرزین نسب", role: "تاسیسات" },
      { name: "حسین کارگر", role: "اینترنت" },
      { name: "سید علیرضا حسینی مخلصون", role: "امنیت" },
      { name: "سید امین رضوی", role: "ورزش" },
      { name: "سینا میری", role: "بهداشت" }
    ]
  },
  {
    name: "خوابگاه طرشت ۲",
    type: "dorm",
    members: [
      { name: "زهرا اکبری", entry: "۹۵ مهندسی شیمی", role: "دبیر و ورزش" },
      { name: "زهرا رضایی", role: "کتابخانه و اینترنت" },
      { name: "کوثر اصغری", role: "تغذیه و بهداشت" },
      { name: "نیلوفر صدقی", role: "امنیت و حراست و روابط عمومی" }
    ]
  }
],
  },
  {
    meta: {'period': 17, 'year': '', 'faTitle': 'دوره هفدهم (سال ۱۳۹۹-۱۴۰۰)', 'description': ''},
    committees: [
  {
    name: "شورای مرکزی دوره هفدهم",
    members: [
      { name: "صابر عزیزمرادی", role: "دبیر" }
    ]
  },
  {
    name: "کمیته آموزش",
    members: [
      { name: "علی ابوالحسن‌زاده ماهانی", role: "دبیر" },
      { name: "امیر سپهر قاصدی", role: "دروس سرویس" },
      { name: "صابر عزیزمرادی", role: "تحصیلات تکمیلی" }
    ]
  },
  {
    name: "کمیته امنیت",
    members: [
      { name: "سجاد ریحانی", role: "دبیر" }
    ]
  },
  {
    name: "کمیته رفاهی",
    members: [
      { name: "فائزه مقدسی", role: "دبیر" },
      { name: "امیرحسین صادقی", role: "آسیب‌های اجتماعی" },
      { name: "صابر عزیزمرادی", role: "خوابگاه" },
      { name: "سجاد ریحانی", role: "تغذیه" }
    ]
  },
  {
    name: "کمیته مالی-اداری",
    members: [
      { name: "مرتضی شمس" }
    ]
  },
  {
    name: "کمیته روابط عمومی",
    members: [
      { name: "امیرحسین صادقی", role: "دبیر و برد و رسانه" },
      { name: "امیر سپهر قاصدی", role: "نشریه" }
    ]
  }
],
    units: [
  {
    name: "دانشکده مهندسی کامپیوتر",
    type: "unit",
    members: [
      { name: "سجاد ریحانی", role: "دبیر" },
      { name: "محمدصالح سعیدی", role: "دبیر داخلی و فنی" },
      { name: "دانا افاضلی", role: "نائب دبیر" },
      { name: "فاطمه عسگری", role: "مالی و اموال" },
      { name: "سارا آذرنوش", role: "آموزش" },
      { name: "محمد فراهانی", role: "سلامت و نشاط" },
      { name: "عبدالصمد حقیری", role: "تحقیق و توسعه" }
    ]
  },
  {
    name: "دانشکده مهندسی مکانیک",
    type: "unit",
    members: [
      { name: "صابر عزیزمرادی", role: "دبیر" },
      { name: "نسیم حق‌دوست", role: "نائب دبیر و مستندسازی" },
      { name: "کوثر حیدری", role: "آموزشی و رفاهی و پردیس و تحصیلات تکمیلی" },
      { name: "محمد نمکی", role: "آموزشی و مهندسی دریا" },
      { name: "امیررضا نیکوکلام", role: "رفاهی" },
      { name: "محمد مددی", role: "آموزشی و رفاهی" },
      { name: "امیرحسین ضیائی", role: "رفاهی و مهندسی دریا" },
      { name: "پارسا پرویزیان", role: "پردیس و تحصیلات تکمیلی و ساختمان جدید" },
      { name: "پوریا فلاحی", role: "آموزشی و ساختمان جدید و رسانه" },
      { name: "علی انصاری", role: "پردیس و تکمیلات تکمیلی و رسانه و مستندسازی" },
      { name: "میلاد حسینی", role: "آموزشی" }
    ]
  },
  {
    name: "دانشکده مهندسی برق",
    type: "unit",
    members: [
      { name: "مرتضی شمس", role: "دبیر" },
      { name: "متین عنا", role: "نائب دبیر و مسئول آموزش" },
      { name: "حامد نجات", role: "مسئول تاسیسات" },
      { name: "احسان جوانی", role: "مسئول امور مالی" },
      { name: "آرمان مقصودنیا", role: "دبیر مجله روشنا" },
      { name: "میلاد سعادت", role: "مسئول روابط عمومی و ارتباط با رسانا" },
      { name: "دانش گرمچی", role: "مسئول کمد و نمایشگاه کتاب" }
    ]
  },
  {
    name: "دانشکده مهندسی عمران",
    type: "unit",
    members: [
      { name: "فائزه مقدسی", role: "دبیر" },
      { name: "ایمان پاکدل", role: "مسئول کمیته آموزش" },
      { name: "سید محمد رادسرشت همدانی", role: "مسئول کمیته تحصیلات تکمیلی" },
      { name: "علی آقازیارتی", role: "مسئول کمیته ورزش" },
      { name: "محمدعرفان طلوعی", role: "مسئول کمیته تاسیسات و ورودی‌های ۹۹ کارشناسی" },
      { name: "محمد زنجانی", role: "مسئول کتابخانه" },
      { name: "فاطمه طباطبایی", role: "مسئول مالی، اداری و روابط عمومی" }
    ]
  },
  // دانشکده مهندسی هوافضا - دو بازه زمانی
  // آبان ۹۹
  {
    name: "دانشکده مهندسی هوافضا",
    type: "unit",
    note: "ترکیب اعضا از آبان تا دی ۱۳۹۹",
    members: [
      { name: "امیرمحمد احمدی", entry: "۹۶", role: "دبیر" },
      { name: "سامان بختیاری", role: "کمیته آموزش و تحصیلات تکمیلی" },
      { name: "فاطمه سادات رضوی", role: "آموزش کارشناسی" },
      { name: "محمد نژاد", role: "کمیته رفاهی" },
      { name: "زهرا شهبازی", role: "مسئول کمدها" },
      { name: "امیرحسین قائمی", role: "روابط عمومی" },
      { name: "کوثر فرقانی", role: "مسئول کتابخانه مجازی و امور روابط عمومی" }
    ]
  },
  // دی ۹۹ به بعد
  {
    name: "دانشکده مهندسی هوافضا",
    type: "unit",
    note: "ترکیب اعضا از دی ۱۳۹۹ به بعد",
    members: [
      { name: "پارسا اینانلو", role: "دبیر" },
      { name: "سامان بختیاری", role: "کمیته آموزش و تحصیلات تکمیلی" },
      { name: "فاطمه سادات رضوی", role: "آموزش کارشناسی" },
      { name: "علی یوسفی", role: "آموزش کارشناسی" },
      { name: "محمد نژاد", role: "کمیته رفاهی" },
      { name: "عرفان استقامت", role: "کمیته روابط عمومی" },
      { name: "کوثر فرقانی", role: "کمیته روابط عمومی" }
    ]
  },
  {
    name: "دانشکده مهندسی صنایع",
    type: "unit",
    note: "از آبان ۱۳۹۹",
    members: [
      { name: "حسن اسماعیلی", role: "دبیر" },
      { name: "شیما رمدانی", role: "نائب دبیر و مالی و اموال" },
      { name: "امیر سپهر قاصدی", role: "نماینده در شورای صنفی مرکزی و کمیته آموزش" },
      { name: "حامد حاتمی", role: "مسئول کمیته آموزش" },
      { name: "حامد شیخیان", role: "مسئول کمیته رفاهی و فرهنگی" },
      { name: "اردوان ایمانخان", role: "مسئول کمیته رفاهی و فرهنگی" },
      { name: "محمدحسین مشک افشان", role: "مسئول کمیته رسانه" }
    ]
  },
  {
    name: "دانشکده مهندسی شیمی و نفت",
    type: "unit",
    note: "از مهر ۱۳۹۹",
    members: [
      { name: "محمدرضا فهمیده وحدت", role: "دبیر" },
      { name: "راضیه بویری", role: "نائب دبیر و مسئول کمیته آموزش دانشجویان ورودی ۹۷" },
      { name: "علی کریم‌زاده", role: "مسئول کمیته آموزش دانشجویان ورودی ۹۶" },
      { name: "مبین اسلامی نیا", role: "مسئول کمیته آموزش دانشجویان ورودی ۹۸" },
      { name: "علیرضا الوانی", role: "مسئول کمیته تحصیلات تکمیلی" },
      { name: "محمدحسین نورا", role: "مسئول امور مالی" },
      { name: "محمدسینا قنبری", role: "مسئول رسانه" },
      { name: "رضا درخشان پور", role: "مسئول رسانه" },
      { name: "کمیل چگینی" },
      { name: "علیرضا حسن‌زاده" },
      { name: "مجید پورنقش بند" }
    ]
  },
  {
    name: "دانشکده مهندسی و علم مواد",
    type: "unit",
    members: []
  },
  {
    name: "دانشکده فیزیک",
    type: "unit",
    members: [
      { name: "علی ابوالحسن زاده ماهانی", role: "دبیر" },
      { name: "فاطمه نوری", entry: "۹۸", role: "آموزش کارشناسی" },
      { name: "امیر سامان کریمی", role: "آموزش عالی" },
      { name: "حسین اربابی", role: "تاسیسات" },
      { name: "حسن حیدری ثانی", role: "روابط عمومی" }
    ]
  },
  {
    name: "دانشکده ریاضی",
    type: "unit",
    note: "از مهر ۱۳۹۹",
    members: [
      { name: "سجاد ولایی", role: "دبیر" },
      { name: "فاطمه مولایی" },
      { name: "عرفان برزین" },
      { name: "ساجد کریمی" },
      { name: "محمدمهدی زارع" },
      { name: "محمد ترابی" },
      { name: "محمدمهدی نسیمی" },
      { name: "حمیدرضا منتصری" }
    ]
  },
  {
    name: "دانشکده شیمی",
    type: "unit",
    note: "از دی ۱۳۹۹",
    members: [
      { name: "محمد نوروزی" },
      { name: "مهدیه حسن‌پور" },
      { name: "صبا پرتوی شفق" },
      { name: "نفیسه پیرهادی" },
      { name: "صابر اسلامی" }
    ]
  },
  {
    name: "دانشکده مهندسی انرژی",
    type: "unit",
    members: []
  },
  {
    name: "دانشکده مدیریت و اقتصاد",
    type: "unit",
    members: []
  },
  // خوابگاه‌ها (مواردی که داده ندادی خالی گذاشتم)
  {
    name: "خوابگاه شهید احمدی روشن",
    type: "dorm",
    members: []
  },
  {
    name: "خوابگاه طرشت ۳",
    type: "dorm",
    members: []
  },
  {
    name: "خوابگاه طرشت ۲",
    type: "dorm",
    members: []
  }
],
  },
  {
    meta: {'period': 18, 'year': '', 'faTitle': 'دوره هجدهم (سال ۱۴۰۰-۱۴۰۱)', 'description': ''},
    committees: [
  {
    name: "شورای مرکزی دوره هجدهم",
    members: [
      { name: "علی محدث‌زاده", role: "دبیر" }
    ]
  },
  {
    name: "کمیته آموزش کارشناسی",
    members: [
      { name: "فرشید غلامی", role: "مسئول" }
    ]
  },
  {
    name: "کمیته آموزش تحصیلات تکمیلی",
    members: [
      { name: "حامد کلانتری", role: "مسئول" }
    ]
  },
  {
    name: "کمیته رفاهی (اسکان، تغذیه و تاسیسات)",
    members: [
      { name: "سپهر یاری", role: "مسئول" },
      { name: "علی آخوندی", role: "مسئول" }
    ]
  },
  {
    name: "کمیته حقوقی-اداری",
    members: [
      { name: "علی قائم‌دوست", role: "مسئول" }
    ]
  },
  {
    name: "کمیته روابط عمومی",
    members: [
      { name: "امیرسپهر قاصدی", role: "مسئول" }
    ]
  }
],
    units: [
  {
    name: "دانشکده مهندسی کامپیوتر",
    type: "unit",
    note: "از آذر ۱۴۰۰",
    members: [
      { name: "حامد کلانتری سرچشمه", role: "دبیر" },
      { name: "محمدطه جهانی‌نژاد", role: "دبیر داخلی" },
      { name: "محمد مشتاقی‌فر", role: "نائب دبیر" },
      { name: "همراز عرفاتی", role: "کمیته مالی و اموال" },
      { name: "مهران معینی‌جم", role: "کمیته آموزش" },
      { name: "فاطمه علیمرادی", role: "کمیته رفاهی" },
      { name: "پرهام چاوشیان", role: "کمیته تحقیق و توسعه" },
      { name: "ابوالفضل حاجی محمد حسین کاشی", role: "کمیته روابط عمومی و فنی" },
      { name: "علی حاتمی تاجیک", role: "عضو کمیته رفاهی، تحقیق و توسعه، روابط عمومی و فنی" },
      { name: "مجید طاهرخانی", role: "عضو کمیته آموزش، رفاهی و تحقیق و توسعه" }
    ]
  },
  // مکانیک با دو ترکیب زمانی
  {
    name: "دانشکده مهندسی مکانیک",
    type: "unit",
    note: "آذر ۱۴۰۰ تا خرداد ۱۴۰۱",
    members: [
      { name: "علی محدث‌زاده", role: "دبیر" },
      { name: "علی انصاری", role: "نائب دبیر" },
      { name: "اسما حلاجی", role: "آموزشی" },
      { name: "امیرحسین احمدنظری", role: "امور مهندسی دریا" },
      { name: "سولماز مجدم", role: "امور کارشناسی و پردیس" },
      { name: "علی بوالحسنی", role: "امور تحصیلات تکمیلی" },
      { name: "پارمیدا افشاری نژاد", role: "رفاهی و ساختمان جدید" },
      { name: "آتنا فقیهیان", role: "رفاهی و ساختمان جدید" },
      { name: "محمدهادی مسماریان", role: "رسانه و روابط عمومی" },
      { name: "پویا دادخواه", role: "رسانه و روابط عمومی" }
    ]
  },
  {
    name: "دانشکده مهندسی مکانیک",
    type: "unit",
    note: "از خرداد ۱۴۰۱",
    members: [
      { name: "علی بوالحسنی", role: "دبیر" },
      { name: "درسا رازقی", role: "امور کارشناسی" },
      { name: "آناهیتا نوری", role: "امور مهندسی دریا" },
      { name: "حسام‌الدین میری", role: "امور کارشناسی و پردیس" },
      { name: "اسما حلاجی", role: "امور تحصیلات تکمیلی" },
      { name: "امیرمحمد بدیعی", role: "امور تحصیلات تکمیلی" },
      { name: "پویا دادخواه", role: "کارگروه رفاهی و ساختمان جدید" },
      { name: "نیکان توکلی", role: "کارگروه رفاهی و ساختمان جدید" },
      { name: "امیرحسین احمدنظری", role: "کارگروه رسانه و روابط عمومی" },
      { name: "علیرضا فکوریان", role: "کارگروه رسانه و روابط عمومی" }
    ]
  },
  {
    name: "دانشکده مهندسی برق",
    type: "unit",
    members: [
      { name: "علی آخوندی", role: "دبیر" },
      { name: "سیده آنیتا مدنی", role: "نائب دبیر و آموزش و رسانه" },
      { name: "مهران منتظر", role: "روابط عمومی و آموزش" },
      { name: "آریا افروز", role: "تاسیسات و رفاهی و رسانه" },
      { name: "محمد محمدبیگی", role: "آموزش و سلامت و نشاط" },
      { name: "علی شهبازی", role: "آموزش" },
      { name: "علی خدنگی", role: "آموزش و سلامت و نشاط" },
      { name: "فاطمه جعفری", role: "رسانه و سلامت و نشاط" },
      { name: "طاهر ابدی", role: "رسانه و سلامت و نشاط" },
      { name: "میثم امیرسرداری", role: "سلامت و نشاط" }
    ]
  },
  {
    name: "دانشکده مهندسی عمران",
    type: "unit",
    members: [
      { name: "فاطمه غلامی", role: "دبیر" },
      { name: "حسین مرشدی", role: "مسئول کمیته تحصیلات تکمیلی و کارآموزی" },
      { name: "محسن مرشدی", role: "مسئول کمیته آموزشی" },
      { name: "سیدمحمدرضا تقوی", role: "مسئول کمیته روابط عمومی" },
      { name: "امیرحسین قنبری", role: "مسئول کمیته تاسیسات و مسئول کتابخانه" },
      { name: "علی آقازیارتی", role: "مسئول کمیته ورزش" },
      { name: "مهدی آل‌بویه", role: "مسئول امور مالی" }
    ]
  },
  {
    name: "دانشکده مهندسی هوافضا",
    type: "unit",
    note: "از آذر ۱۴۰۰",
    members: [
      { name: "علی قائم‌دوست", role: "دبیر" },
      { name: "علی رشیدی", role: "نائب دبیر و آموزش کارشناسی" },
      { name: "محمد قندهاری", role: "آموزش کارگاه‌ها و آزمایشگاه‌ها" },
      { name: "فاطمه عباسی", role: "آموزش تحصیلات تکمیلی" },
      { name: "امید صفرزاده", role: "کمیته رفاهی" },
      { name: "سها ایل‌بیگی عراقی", role: "کمیته رفاهی" },
      { name: "رویا گیتی‌پیما", role: "کمیته روابط عمومی" }
    ]
  },
  {
    name: "دانشکده مهندسی صنایع",
    type: "unit",
    note: "از آذر ۱۴۰۰",
    members: [
      { name: "امیرسپهر قاصدی", role: "دبیر" },
      { name: "مبینا حسن‌زاده آذر", role: "نائب‌دبیر و مسئول مالی" },
      { name: "محمدشریف آشنا", role: "مسئول کمیته آموزش" },
      { name: "رکسانا خباززاده مقدم", role: "مسئول کمیته آموزش" },
      { name: "مهدی رحمانی‌طلب", role: "مسئول کمیته رفاهی" },
      { name: "محمدحسین فلاحتی", role: "مسئول کمیته رفاهی" },
      { name: "محمدحسین مشک‌افشان", role: "مسئول کمیته فرهنگی" }
    ]
  },
  {
    name: "دانشکده مهندسی شیمی و نفت",
    type: "unit",
    note: "از آذر ۱۴۰۰",
    members: [
      { name: "پریا نعمتم‌الهی", role: "دبیر" },
      { name: "امیرمهدی خطیبیون", role: "نائب دبیر و مسئول آموزش" },
      { name: "محمدسینا قنبری", role: "مسئول کمیته تحصیلات تکمیلی" },
      { name: "عاطفه شعبانلو", role: "مسئول کمیته آموزش دانشجویان ورودی ۹۷" },
      { name: "بهاره اسعدی", role: "مسئول کمیته آموزش دانشجویان ورودی ۹۸" },
      { name: "یاسمن گریوانی", role: "مسئول کمیته آموزش دانشجویان ورودی ۹۹ و ۱۴۰۰" },
      { name: "مهدی نجفی‌زاده", role: "مسئول امور مالی" },
      { name: "ابوالفضل اخلاقی", role: "مسئول رسانه" },
      { name: "سهیل رنجبر" },
      { name: "رادمان علیزاده" },
      { name: "شایان دبیری" }
    ]
  },
  {
    name: "دانشکده مهندسی و علم مواد",
    type: "unit",
    note: "از آذر ۱۴۰۰",
    members: [
      { name: "علی شمس", role: "دبیر و مسئول کمیته مالی و اموال" },
      { name: "علی قلیچ‌خانی", role: "نائب دبیر و مسئول کمیته آموزش" },
      { name: "سپهر یاری", role: "مسئول کمیته رفاهی" },
      { name: "رومینا ایوبی حاجی‌آبادی", role: "مسئول کمیته آموزش" },
      { name: "فاطمه رمضانی عراقی", role: "مسئول کمیته مالی و اموال" },
      { name: "نیلوفر کاردان", role: "مسئول روابط عمومی و رسانه" },
      { name: "سحر مجیدی", role: "مسئول روابط عمومی و رسانه" }
    ]
  },
  {
    name: "دانشکده فیزیک",
    type: "unit",
    note: "از آذر ۱۴۰۰",
    members: [
      { name: "فرشید غلامی", role: "دبیر" },
      { name: "سپیده حسینی", role: "کمیته آموزش" },
      { name: "کاویان زارع", role: "کمیته فرهنگی" },
      { name: "هانیه حاتمی", role: "کمیته رفاهی" },
      { name: "علیرضا سامع", role: "روابط عمومی" },
      { name: "زهرا اکبری" },
      { name: "علیرضا آستانه" }
    ]
  },
  // ریاضی با دو ترکیب زمانی
  {
    name: "دانشکده ریاضی",
    type: "unit",
    note: "از آذر ۱۴۰۰",
    members: [
      { name: "سیدمهرشاد اولاد صاحب‌مدارک", role: "دبیر" },
      { name: "سیدمحمد ترابی", role: "نائب دبیر" },
      { name: "سیدامیرمحمد سادات‌شکوهی", role: "آموزش" },
      { name: "متین یوسفی", role: "فرهنگی" },
      { name: "سیدشاهد رضوی‌زاده", role: "تاسیسات" },
      { name: "محمدرضا فتح‌اللهی", role: "رسانه" },
      { name: "متین یوسفی", role: "مستندسازی" },
      { name: "باران بحری", role: "مالی" }
    ]
  },
  {
    name: "دانشکده ریاضی",
    type: "unit",
    note: "از آبان ۱۴۰۱",
    members: [
      { name: "امیراحمد شفیعی", role: "دبیر" },
      { name: "مهدی سلحشور", role: "ارتباط با مرکز" },
      { name: "آرش نوروززاده", role: "مسئول مستندسازی" },
      { name: "سینا قاسمی‌نژاد", role: "آموزشی" },
      { name: "هادی هادوی", role: "تاسیسات" },
      { name: "ریحانه قاضی‌زاده", role: "فرهنگی" },
      { name: "آرین همتی", role: "اداری" }
    ]
  },
  {
    name: "دانشکده شیمی",
    type: "unit",
    members: [
      { name: "مهدیه حسن‌پور" },
      { name: "صبا پرتوی شفق" },
      { name: "فاطمه باقری" },
      { name: "ستاره ساجد" },
      { name: "آیدین باقری" }
    ]
  },
  {
    name: "دانشکده مهندسی انرژی",
    type: "unit",
    members: []
  },
  {
    name: "دانشکده مدیریت و اقتصاد",
    type: "unit",
    members: []
  },
  {
    name: "خوابگاه شهید احمدی روشن",
    type: "dorm",
    members: []
  },
  {
    name: "خوابگاه طرشت ۳",
    type: "dorm",
    members: []
  },
  {
    name: "خوابگاه طرشت ۲",
    type: "dorm",
    members: []
  }
],
  },
  {
    meta: {'period': 19, 'year': '', 'faTitle': 'دوره نوزدهم (سال ۱۴۰۱-۱۴۰۲)', 'description': ''},
    committees: [
  {
    name: "شورای مرکزی دوره نوزدهم",
    members: [
      { name: "امیرعلی رستمی", role: "دبیر" },
      { name: "سینا صفی‌زاده", role: "نائب دبیر" }
    ]
  },
  {
    name: "کارگروه مالی",
    members: [
      { name: "پارسا نوروزی‌نژاد", role: "مسئول" }
    ]
  },
  {
    name: "کارگروه آموزش",
    members: [
      { name: "سینا صفی‌زاده" },
      { name: "شایان سعادتیان" },
      { name: "پوریا فرخ‌مآل" }
    ]
  },
  {
    name: "کارگروه رفاهی",
    members: [
      { name: "محمد عموشاهی" },
      { name: "دانیال پیرا" },
      { name: "علیرضا فکوریان" }
    ]
  },
  {
    name: "کارگروه حراست، حقوقی و اداری",
    members: [
      { name: "میترا ملکی" },
      { name: "آریا ترابی" }
    ]
  },
  {
    name: "کارگروه روابط عمومی",
    members: [
      { name: "آریا ترابی" }
    ]
  }
],
    units: [
  {
    name: "دانشکده مهندسی کامپیوتر",
    type: "unit",
    members: [
      { name: "امیرعلی رستمی", role: "دبیر" },
      { name: "اشکان مجیدی‌خامنه", role: "نائب دبیر" },
      { name: "آریا ترابی", role: "حقوقی و نماینده در مرکز" },
      { name: "حمیدرضا علی‌پور", role: "روابط عمومی" },
      { name: "امیرحسین اکبری", role: "آموزشی" },
      { name: "امیرسعید احمدی", role: "رفاهی و مالی" },
      { name: "ترانه خسروجردی", role: "رفاهی و مالی" }
    ]
  },
  {
    name: "دانشکده مهندسی مکانیک",
    type: "unit",
    members: [
      { name: "علیرضا فکوریان", role: "دبیر" },
      { name: "نیکان توکلی", role: "نائب دبیر" },
      { name: "محمدحسین شهنازی", role: "امور مهندسی مکانیک" },
      { name: "آنوشا اردشیری", role: "امور مهندسی دریا" },
      { name: "امیدرضا نظری", role: "مسئول رفاهی" },
      { name: "علی فربانیپور", role: "رسانه و روابط عمومی" },
      { name: "علیرضا آرین", role: "رسانه و روابط عمومی" }
    ]
  },
  {
    name: "دانشکده مهندسی برق",
    type: "unit",
    members: [
      { name: "پارسا نوروزی‌نژاد", role: "دبیر" },
      { name: "نیلوفر دهقان", role: "نائب دبیر و مسئول فرهنگی" },
      { name: "سینا صفی‌زاده", role: "نماینده در مرکز" },
      { name: "یحیی تهرانی", role: "آموزشی" },
      { name: "احسان مریخی", role: "روابط عمومی" },
      { name: "عیسی فتحی", role: "رفاهی و تاسیسات" },
      { name: "آرمان اقلیمی", role: "کمدها" }
    ]
  },
  {
    name: "دانشکده مهندسی هوافضا",
    type: "unit",
    members: [
      { name: "سیدشایان سعادتیان", role: "دبیر" },
      { name: "محمدعرفان تاجمیری", role: "نائب دبیر" },
      { name: "علیرضا عالی‌نژاد", role: "کمیته امور رفاهی" },
      { name: "محمدسجاد نشاسته‌گیرپور", role: "کمیته امور آموزشی" },
      { name: "احلام اشگرف", role: "روابط عمومی" }
    ]
  },
  {
    name: "دانشکده مهندسی صنایع",
    type: "unit",
    members: [
      { name: "مهدی رحمانی‌طلب", role: "دبیر" },
      { name: "دانیال پیرا", role: "نائب دبیر و مسئول مالی" },
      { name: "سجاد رضایی", role: "مسئول کمیته آموزش" },
      { name: "ثنا منصوری", role: "مسئول کمیته آموزش" },
      { name: "حسنی رحیم‌زاده", role: "مسئول کمیته رفاهی" }
    ]
  },
  {
    name: "دانشکده مهندسی شیمی و نفت",
    type: "unit",
    members: [
      { name: "امیرحسین فتوحی", role: "دبیر" },
      { name: "پویا حق‌وردی", role: "آموزش مهندسی شیمی" },
      { name: "حمیدرضا محمدنژاد", role: "آموزش مهندسی نفت" },
      { name: "پارسا ایمانی", role: "حقوقی" },
      { name: "امیرحسین امیرلطیفی", role: "مالی و کمد" },
      { name: "محمد بابازاده", role: "تاسیسات" },
      { name: "سوگل اقبالی", role: "کتابخانه" },
      { name: "آرمینا ضیاحسینی", role: "روابط عمومی" }
    ]
  },
  {
    name: "دانشکده مهندسی و علم مواد",
    type: "unit",
    members: [
      { name: "علی حلاجان", role: "دبیر و مسئول کمیته رفاهی" },
      { name: "معین یامولا", role: "نائب دبیر و مسئول کمیته حقوقی" },
      { name: "دلناز بدوره", role: "مسئول کمیته آموزش" },
      { name: "محدثه شمس", role: "مسئول کمیته آموزش" },
      { name: "ابوالفضل عسگری پاریزی", role: "مسئول کمیته آموزش" }
    ]
  },
  {
    name: "دانشکده فیزیک",
    type: "unit",
    members: [
      { name: "میترا ملکی", role: "دبیر" },
      { name: "علیرضا آستانه", role: "نائب دبیر و امور آموزشی" },
      { name: "سونیا سیف", role: "امور دانشجویی" },
      { name: "سپهر سلمانی یگانه", role: "روابط دانشجویی" },
      { name: "علی جروقی", role: "امور رفاهی" }
    ]
  },
  {
    name: "دانشکده شیمی",
    type: "unit",
    members: [
      { name: "پوریا فرخ‌مآل", role: "دبیر و روابط عمومی" },
      { name: "آیدین باقری", role: "کمیته آموزش" },
      { name: "ابوالفضل برزه", role: "کمیته رفاهی و حقوقی" },
      { name: "راحیل رمضانی", role: "کمیته رفاهی" },
      { name: "نرگس تورئی", role: "کمیته آموزش و روابط عمومی" }
    ]
  },
  {
    name: "خوابگاه شهید احمدی روشن",
    type: "dorm",
    members: [
      { name: "محمد عموشاهی", role: "دبیر" },
      { name: "علی مروتی", role: "تاسیسات" },
      { name: "محمدحسین نریمانی", role: "تاسیسات" },
      { name: "آریانا کوچکی داریونی", role: "بهداشت" },
      { name: "سید امیرمهدی خالقی", role: "تغذیه" },
      { name: "احسان اسدی", role: "سالن مطالعه و اینترنت" },
      { name: "علی امینی", role: "روابط عمومی" }
    ]
  }
  // سایر دانشکده‌ها و خوابگاه‌ها، اگر اطلاعات گرفتی قابل اضافه شدن است.
],
  },
  {
    meta: {'period': 20, 'year': '', 'faTitle': 'دوره بیستم (سال ۱۴۰۲-۱۴۰۳)', 'description': ''},
    committees: [
  { name: "دبیر شورای صنفی", members: [{ name: "محمد عموشاهی", role: "دبیر" }] },
  { name: "نائب دبیر", members: [{ name: "فرزاد رحمانی", role: "نائب دبیر" }] },
  { name: "مسئول رسانه", members: [{ name: "امیرحسین صوری", role: "مسئول رسانه" }] },
  { name: "مسئول نشریه", members: [{ name: "آریا ترابی", role: "عضو غیررسمی" }] },
  { name: "سردبیر نشریه", members: [{ name: "کیمیا نسترن", role: "سردبیر" }] },
  { name: "مسئول واحد حقوقی", members: [{ name: "فرزاد رحمانی", role: "حقوقی" }] },
  { name: "مسئول تاسیسات", members: [{ name: "سید مهدی منصوری", role: "تاسیسات" }] },
  {
    name: "فعالین نشریه و رسانه",
    members: [
      { name: "امیرحسین شهیدی", role: "عضو غیررسمی" }
    ]
  },
  {
    name: "فعالین واحد بانوان",
    members: [
      { name: "نیلوفر جوادی" }
    ]
  },
  {
    name: "فعالین خوابگاه طرشت ۲",
    members: [
      { name: "بهاره حیدری", role: "عضو غیررسمی" }
    ]
  },
  {
    name: "مسئولین آموزشی",
    members: [
      { name: "ارشیا درستکار" },
      { name: "امیرحسین صفری" }
    ]
  }
],
    units: [
  {
    name: "دانشکده مهندسی کامپیوتر",
    type: "unit",
    members: [
      { name: "امیرحسین صوری", role: "دبیر" },
      { name: "کیان عمو خادم", role: "نائب دبیر" },
      { name: "پوریا غفوری", role: "روابط عمومی" },
      { name: "محمد علیزاده", role: "آموزشی" },
      { name: "محمد اسماعیلی مرندی", role: "آموزشی" },
      { name: "پارسا ملکیان", role: "آموزشی" },
      { name: "معین آعلی", role: "رفاهی و مالی" }
    ]
  },
  {
    name: "دانشکده مهندسی مکانیک",
    type: "unit",
    members: [
      { name: "علیرضا آرین", role: "دبیر" },
      { name: "علی قربانپور", role: "نائب دبیر" },
      { name: "امیرمحمد همیانی", role: "امور مهندسی مکانیک" },
      { name: "مهدیار مصلی", role: "امور مهندسی دریا" },
      { name: "محمدپوریا علی‌محمدی", role: "رفاهی" },
      { name: "سیدرضا رضی", role: "رفاهی" },
      { name: "زهرا ردائی", role: "رفاهی و رسانه و روابط عمومی" }
    ]
  },
  {
    name: "دانشکده مهندسی برق",
    type: "unit",
    members: [
      { name: "مینه کلنتریان", role: "دبیر و امور مالی" },
      { name: "حسین فرحناکی", role: "نائب دبیر و رفاهی و تاسیسات" },
      { name: "کیمیا نسترن", role: "روابط عمومی و بانوان" },
      { name: "آرمان اقلیمی", role: "صنفی مرکز و حقوقی" },
      { name: "سپهر المدنی", role: "آموزشی" },
      { name: "محمدامین خوشکام", role: "آموزشی" },
      { name: "محمدمهدی شکری", role: "رفاهی و تاسیسات" },
      { name: "عارف بهجت خاتونی", role: "حقوقی" }
    ]
  },
  {
    name: "دانشکده مهندسی هوافضا",
    type: "unit",
    members: [
      { name: "علیرضا پارسا", role: "دبیر" },
      { name: "ریحانه سادات مرتضوی", role: "آموزش کارشناسی و رفاهی" },
      { name: "فاطمه زاهدی‌فر", role: "آموزش تحصیلات تکمیلی و رفاهی" },
      { name: "شیوا شاهمیرزایی", role: "روابط عمومی" }
    ]
  },
  {
    name: "دانشکده مهندسی صنایع",
    type: "unit",
    members: [
      { name: "سجاد رضائی", role: "دبیر" },
      { name: "حسنا حر", role: "نائب‌دبیر و مسئول مالی" },
      { name: "فرزاد رحمانی", role: "مسئول کمیته رفاهی" },
      { name: "پارسا بهمنش", role: "مسئول کمیته آموزش" },
      { name: "محمد شبانیان", role: "مسئول کمیته آموزش" }
    ]
  },
  {
    name: "دانشکده مهندسی شیمی و نفت",
    type: "unit",
    members: [
      { name: "آرین مدنی", role: "دبیر" },
      { name: "محمد توفیقی", role: "نائب دبیر" },
      { name: "سید عرفان حجتی محمدی", role: "آموزش مهندسی شیمی" },
      { name: "محمد امین توکلی", role: "آموزش نفت و ورزشی" },
      { name: "محمد موسوی", role: "حقوقی" },
      { name: "میعاد رضائی فرد کردلو", role: "مالی" },
      { name: "امیررضا عبدالهی", role: "کمد" },
      { name: "سیده فاطمه زهرا موسوی کرچائی", role: "کتابخانه" },
      { name: "امیرمهدی تاجیک", role: "تاسیسات" },
      { name: "امیرحسین اکبرنیا", role: "روابط عمومی" }
    ]
  },
  {
    name: "دانشکده مهندسی و علم مواد",
    type: "unit",
    members: [
      { name: "پارسا ساسانی", role: "دبیر و مسئول کارگروه آموزش" },
      { name: "عارف اویسی", role: "نائب دبیر و مسئول کارگروه حقوقی" },
      { name: "محمدمهدی نیلاش", role: "مسئول کارگروه آموزش" },
      { name: "ارشیا درستکار", role: "مسئول کارگروه رفاهی" },
      { name: "محمدحسین قلی‌پور", role: "مسئول کارگروه حقوقی" }
    ]
  },
  {
    name: "دانشکده فیزیک",
    type: "unit",
    members: [
      { name: "متین جوکار", role: "دبیر" },
      { name: "سوگل امیری", role: "نائب دبیر و امور دانشجویی" },
      { name: "زهرا امیری", role: "امور آموزشی" },
      { name: "سونیا سیف آذر نژاد", role: "روابط عمومی" },
      { name: "سام مقصودی انوری", role: "امور رفاهی" }
    ]
  },
  {
    name: "دانشکده ریاضی",
    type: "unit",
    members: [
      { name: "میرحسین عدنانی اسکوئی", role: "دبیر" },
      { name: "علی داورجاه", role: "نائب دبیر"},
      { name: "ستاره حامی", role: "مسئول آموزش" },
      { name: "عبدالله ظهرابی", role: "مسئول تاسیسات" },
      { name: "مهدی طاهری جانبازلو", role: "روابط عمومی" },
      { name: "علی داورجاه", role: "فرهنگی" }
    ]
  },
  // اطلاعات دانشکده عمران فعلاً داده نشده - می‌توان بعداً اضافه کرد

  {
    name: "دانشکده شیمی",
    type: "unit",
    members: [
      { name: "پوریا فرخ‌مآل", role: "دبیر" },
      { name: "پارسا داستانگو", role: "نائب دبیر و کمیته آموزش" },
      { name: "راحیل رمضانی", role: "کمیته رفاهی" },
      { name: "پریا شیرمحمدی", role: "کمیته روابط عمومی" },
      { name: "نرگس تورئی", role: "کمیته حقوقی" }
    ]
  },
  {
    name: "خوابگاه شهید احمدی روشن",
    type: "dorm",
    members: [
      { name: "محمد عموشاهی", role: "دبیر" },
      { name: "محمدرضا بنائیان", role: "نائب دبیر" },
      { name: "محمدمهدی روح‌الامین", role: "تاسیسات" },
      { name: "سید محمدمهدی موسوی", role: "تغذیه" },
      { name: "سید محمدصادق احمدزاده", role: "سالن مطالعه و سوله" },
      { name: "سید مهدی منصوری", role: "اینترنت" },
      { name: "سبحان ارشدی", role: "روابط عمومی" }
    ]
  }
  // موارد دیگر مثل طرشت۲ و ... فعلاً فقط در کمیته‌های مرکزی ذکر شده‌اند
],
  },
  {
    meta: {
    period: 26,
    year: "۱۴۰۳-۱۴۰۴",
    faTitle: "دوره بیست‌وششم شورای صنفی (۱۴۰۳-۱۴۰۴)",  
    description: `
    از آن‌جا که ۵ دوره جدید پیش از دوره یکم پیدا شد و همچنین دوره‌ها نباید براساس شورای مرکز، بلکه بر اساس برگزاری انتخابات باشند، قرار بر این شد که ۵ دوره موردنظر را از این‌جا به بعد لحاظ کنیم.
    پس از برگزاری انتخابات، مشخص شد که معاونت در شمارش آرا اشتباه کرده و از این رو باتوجه به نهایی شدن نتایج اولیه، تصمیم بر آن شد که اعضای فعلی، باقی بمانند و اعضای جدید، یعنی آقایان:
    عرفان استادی (عمران)، علی یزدانی (شیمی)، امیرمهدی خلوتی (صنایع)، به اعضای علی‌البدل دانشکده‌ها اضافه شوند.
    برخی دانشکده‌ها، بنا به این موضوع، تعداد علی‌البدل بیشتری دارند.
    `.trim(),
    },
    committees: [
        { name: "دبیر شورای صنفی", members: [{ name: "tba" }] },
        { name: "نائب دبیر", members: [{ name: "tba" }] }
    ],
    units: [
    {
        name: "دانشکده مهندسی کامپیوتر",
        type: "unit",
        members: [
        { name: "نرگس کاری", role: "دبیر خارجی (دبیر اصلی)" },
        { name: "پوریا غفوری", role: "دبیر داخلی" },
        { name: "سید احمد موسوی اول" },
        { name: "فاطمه نیلفروشان دردشتی" },
        { name: "عرفان تیموری" },
        { name: "امیرحسین یگانه دوست", role: "علی‌البدل غیررسمی" },
        { name: "رهام قاسمی قمی", role: "علی‌البدل غیررسمی" }
        ]
    },
    {
        name: "دانشکده مهندسی مکانیک",
        type: "unit",
        members: [
        { name: "سید علی هدایتی" },
        { name: "زهرا حیدری زاده" },
        { name: "ویونا تمیزی" },
        { name: "سید رضا رضی", role: "دبیر"  },
        { name: "هانی مظفری" },
        { name: "حسین خوارزمی", role: "علی‌البدل" },
        { name: "امیرمهدی نیازی", role: "علی‌البدل" }
        ]
    },
    {
        name: "دانشکده مهندسی برق",
        type: "unit",
        members: [
        { name: "پرهام مشعشعی" },
        { name: "محمد امین خوشکام" },
        { name: "آرمان اقلیمی فرگوش", note: "استعفا در روزهای ابتدایی" },
        { name: "عارف بهجت خاتونی", role: "دبیر"  },
        { name: "پارسا نیکوکلام یعقوبی", note: "استعفا در روزهای ابتدایی" },
        { name: "امین بهتویی", role: "علی‌البدل - عضو اصلی پس از استعفای سایرین" },
        { name: "علی مستأجران گورتانی", role: "علی‌البدل - عضو اصلی پس از استعفای سایرین" }
        ]
    },
    {
        name: "دانشکده مهندسی هوافضا",
        type: "unit",
        members: [
        { name: "امیر حسام قاسم زاده", role: "دبیر"  },
        { name: "ابوالفضل غلامی" },
        { name: "هلنا هوشیاری", note: "استعفا در روزهای ابتدایی" },
        { name: "سام ناصری", role: "علی‌البدل" },
        { name: "ماهان کاکاوند", role: "علی‌البدل" }
        ]
    },
    {
        name: "دانشکده مهندسی صنایع",
        type: "unit",
        members: [
        { name: "بیتا باقر" },
        { name: "فرزاد رحمانی شمسی", role: "دبیر" },
        { name: "محمد عرفان کلماتیان" },
        { name: "آرمان رحیمی", role: "علی‌البدل" },
        { name: "سلوی دانشور", role: "علی‌البدل" },
        { name: "امیر مهدی خلوتی", role: "علی‌البدل" }
        ]
    },
    {
        name: "دانشکده مهندسی شیمی و نفت",
        type: "unit",
        members: [
        { name: "کیارش پیری" },
        { name: "امیر رضا نجف وند" },
        { name: "سید عرفان حجتی محمدی" , role: "دبیر" },
        { name: "محمد علی ایزدی زمان آبادی" },
        { name: "زهرا موحد" },
        { name: "میعاد رضایی فرد کردلو", role: "علی‌البدل" },
        { name: "علی یزدانی", role: "علی‌البدل" },
        { name: "آرشام برقی", role: "علی‌البدل" }
        ]
    },
    {
        name: "دانشکده مهندسی و علم مواد",
        type: "unit",
        members: [
        { name: "ارشیا درستکار", note: "استعفا در روزهای ابتدایی" },
        { name: "زهرا سربندی" },
        { name: "محمد حسین قلی پور", role: "دبیر"  },
        { name: "علی‌رضا هواسی", role: "علی‌البدل" },
        { name: "کیانا رمضان زاده", role: "علی‌البدل" }
        ]
    },
    {
        name: "دانشکده مهندسی عمران",
        type: "unit",
        members: [
        { name: "هیوا شاهپری" },
        { name: "علیرضا ناصری سیس" },
        { name: "الهام رحمتی" },
        { name: "فاطمه شمسائی" },
        { name: "فاطمه صدیقی پاشاکی", role: "دبیر"  },
        { name: "حنانه فتح الهی" },
        { name: "عرفان استادی", role: "علی‌البدل" },
        { name: "ریحانه السادات موسوی", role: "علی‌البدل" }
        ]
    },
    {
        name: "دانشکده فیزیک",
        type: "unit",
        members: [
        { name: "حسن براتی" },
        { name: "ایلیا نوری" },
        { name: "سپهر سلمانی یگانه", role: "دبیر"  },
        { name: "ارین گودرزی", role: "علی‌البدل" },
        { name: "معراج رایت", role: "علی‌البدل" }
        ]
    },
    {
        name: "دانشکده ریاضی",
        type: "unit",
        members: [
        { name: "مهدی طاهری جانبازلو" },
        { name: "ستاره حامی" },
        { name: "میرحسین عدنانی اسکوئی", role: "دبیر"  },
        { name: "محمد برکتین", role: "علی‌البدل" },
        { name: "علیرضا جنتی", role: "علی‌البدل" }
        ]
    },
    {
        name: "دانشکده شیمی",
        type: "unit",
        members: [
        { name: "پارسا داستانگو", role: "دبیر"  },
        { name: "پروا هوشیار" },
        { name: "بردیا بزمی" },
        { name: "هلیا طاهر رحیمی" },
        { name: "سحر حسینی منفرد", role: "علی‌البدل" }
        ]
    },
    {
        name: "دانشکده مدیریت و اقتصاد",
        type: "unit",
        members: [
        { name: "زهرا بقراط پور" },
        { name: "حمیدرضا نوری" },
        { name: "یگانه کربلایی علی", role: "دبیر"  },
        { name: "فاطمه محمدیان", role: "علی‌البدل" },
        { name: "فاطمه رحیمی", role: "علی‌البدل" }
        ]
    },
    {
        name: "دانشکده مهندسی انرژی",
        type: "unit",
        members: [
        { name: "شایان دفتری بشلی" },
        { name: "مهدی سید معلمی" , role: "دبیر" },
        { name: "امیررضا اخروی محبی" },
        { name: "هادی کاظمی", role: "علی‌البدل" },
        { name: "مهران رحیمی", role: "علی‌البدل" }
        ]
    },
    {
        name: "خوابگاه شهید احمدی روشن",
        type: "dorm",
        members: [
        { name: "مجید محمدی", role: "دبیر"  },
        { name: "محمد صادق شاهنسایی" },
        { name: "محمد امین رضائی" },
        { name: "حسین شمس الدینی لری" },
        { name: "محمد طه صدری" },
        { name: "مشتاق معتضدیان", role: "علی‌البدل" },
        { name: "حامد علی نژاد", role: "علی‌البدل" }
        ]
    },
    {
        name: "خوابگاه طرشت ۲",
        type: "dorm",
        members: [
        { name: "درسا صفارحمیدی", role: "دبیر"  },
        { name: "ستایش کاملی" },
        { name: "صبا سادات حسینی" },
        { name: "پریسا فراش بام", role: "علی‌البدل" },
        { name: "سارا صمدی", role: "علی‌البدل" }
        ]
    },
    {
        name: "خوابگاه طرشت ۳",
        type: "dorm",
        members: [
        { name: "علی امیری" },
        { name: "عرفان بیدمشکی", role: "دبیر"  },
        { name: "محمد امین ابوهادی" },
        { name: "علی یزدانی احمدابادی" },
        { name: "آرین شباهنگ" },
        { name: "سیدعلی زندوی", role: "علی‌البدل" },
        { name: "رضا نظریه", role: "علی‌البدل" }
        ]
    }
    ]
}
];


const orangutanPeriods = council_periods.filter(
  p => [0, -1, -2, -3, -4].includes(p.meta.period)
);
const bronzePeriods = council_periods.filter(
  p => [1, 2, 3].includes(p.meta.period)
);
const silverPeriods = council_periods.filter(
  p => [4, 5].includes(p.meta.period)
);
const goldPeriods = council_periods.filter(
  p => [6, 7,8,9].includes(p.meta.period)
);
const rebornPeriods = council_periods.filter(
  p => [10, 11,12,13].includes(p.meta.period)
);
const deathPeriods = council_periods.filter(
  p => [14, 15,16,17,18].includes(p.meta.period)
);
const rebirthPeriods = council_periods.filter(
  p => [19, 20,26].includes(p.meta.period)
);

export const groupedPeriods =[
  {
    groupTitle: "ماقبل مرکز (سال ۷۷-۸۲)",
    periods: orangutanPeriods
  },
    {
      groupTitle: "دوران برنزی (سال ۸۲-۸۵)",
      periods: bronzePeriods
    },
    {
      groupTitle: "دوران نقره‌ای (سال ۸۵-۸۷)",
      periods: silverPeriods
    },
    {
      groupTitle: "دوران طلایی (سال ۸۷-۹۱)",
      periods: goldPeriods
    },
    {
      groupTitle: "دوران احیاء (سال ۹۱-۹۶)",
      periods: rebornPeriods
    },
    {
      groupTitle: "دوران بحران (سال ۹۶-۴۰۱)",
      periods: deathPeriods
    },
    {
      groupTitle: "تولد دوباره (سال ۴۰۱-امروز)",
      periods: rebirthPeriods
    }
]
